$Revision: 4 $

//=============================================================================//
..//描画処理
//=============================================================================//
//=============================================================================//
...//移動系列
//=============================================================================//
//――――――――――――――――――――――――――――――――――――――//
....//通常移動
//――――――――――――――――――――――――――――――――――――――//

function FadeM("ナット名",描画時間,透過度,t,x,y,テンポ, 待ち)
{
	Fade("ナット名",描画時間,透過度,null,false);
	Move("ナット名", t, x, y, テンポ, 待ち);
}

function FadeMM("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$x2 = - $x;
	$y2 = - $y;

	Move("ナット名", 0, @$x2, @$y2, null, true);
	Fade("ナット名",描画時間,透過度,null,false);
	Move("ナット名", t, @$x, @$y, テンポ, 待ち);
}

//――――――――――――――――――――――――――――――――――――――//
....//基点変更移動
//――――――――――――――――――――――――――――――――――――――//

function FadeMEX("ナット名",描画時間,透過度,t,x,y,x2,y2,テンポ, 待ち)
{
	Move("ナット名", 0, x2, y2, null, true);
	Fade("ナット名",描画時間,透過度,null,false);
	Move("ナット名", t, x, y, テンポ, 待ち);
}

//――――――――――――――――――――――――――――――――――――――//
....//二次曲線
//――――――――――――――――――――――――――――――――――――――//

function FadeX("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 10) * 1;
	$Y2 = ($Y1 / 10) * 9;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@0,@$Y2}{@$X2,@$Y1}(@$X1,@$Y1), テンポ, 待ち);
}

function FadeY("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 10) * 9;
	$Y2 = ($Y1 / 10) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@0}{@$X1,@$Y2}(@$X1,@$Y1), テンポ, 待ち);
}


function FadeXX("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = - $y;

	$X2 = ($X1 / 10) * 9;
	$Y2 = $Y1 / 10;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X1,@$Y2}{@$X2,@0}(@0,@0), テンポ, 待ち);
}

function FadeYY("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = - $y;

	$X2 = $X1 / 10;
	$Y2 = ($Y1 / 10) * 9;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y1}{@0,@$Y2}(@0,@0), テンポ, 待ち);
}

//――――――――――――――――――――――――――――――――――――――//
....//半円移動
//――――――――――――――――――――――――――――――――――――――//
//――――――――――――――――――――――――――――――――――――――//
.....//Ⅹ均等
//――――――――――――――――――――――――――――――――――――――//

function FadeXH("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 3) * 1;
	$X3 = ($X1 / 3) * 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXH2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 6) * 1;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXH3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 9) * 1;
	$X3 = ($X1 / 9) * 2;
	$X4 = ($X1 / 9) * 3;
	$X5 = ($X1 / 9) * 4;
	$X6 = ($X1 / 9) * 5;
	$X7 = ($X1 / 9) * 6;
	$X8 = ($X1 / 9) * 7;
	$X9 = ($X1 / 9) * 8;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXH4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 12) * 1;
	$X3 = ($X1 / 12) * 2;
	$X4 = ($X1 / 12) * 3;
	$X5 = ($X1 / 12) * 4;
	$X6 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X8 = ($X1 / 12) * 7;
	$X9 = ($X1 / 12) * 8;
	$X10 = ($X1 / 12) * 9;
	$X11 = ($X1 / 12) * 10;
	$X12 = ($X1 / 12) * 11;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXH5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 15) * 1;
	$X3 = ($X1 / 15) * 2;
	$X4 = ($X1 / 15) * 3;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 5;
	$X7 = ($X1 / 15) * 6;
	$X8 = ($X1 / 15) * 7;
	$X9 = ($X1 / 15) * 8;
	$X10 = ($X1 / 15) * 9;
	$X11 = ($X1 / 15) * 10;
	$X12 = ($X1 / 15) * 11;
	$X13 = ($X1 / 15) * 12;
	$X14 = ($X1 / 15) * 13;
	$X15 = ($X1 / 15) * 14;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@$X1,@0), テンポ, 待ち);

}

//=============================================================================//

function FadeXHH("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X3 = ($X1 / 3) * 1;
	$X2 = ($X1 / 3) * 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXHH2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = -$x;
	$Y1 = $y;

	$X6 = ($X1 / 6) * 1;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHH3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X9 = ($X1 / 9) * 1;
	$X8 = ($X1 / 9) * 2;
	$X7 = ($X1 / 9) * 3;
	$X6 = ($X1 / 9) * 4;
	$X5 = ($X1 / 9) * 5;
	$X4 = ($X1 / 9) * 6;
	$X3 = ($X1 / 9) * 7;
	$X2 = ($X1 / 9) * 8;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHH4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X12 = ($X1 / 12) * 1;
	$X11 = ($X1 / 12) * 2;
	$X10 = ($X1 / 12) * 3;
	$X9 = ($X1 / 12) * 4;
	$X8 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X6 = ($X1 / 12) * 7;
	$X5 = ($X1 / 12) * 8;
	$X4 = ($X1 / 12) * 9;
	$X3 = ($X1 / 12) * 10;
	$X2 = ($X1 / 12) * 11;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHH5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X15 = ($X1 / 15) * 1;
	$X14 = ($X1 / 15) * 2;
	$X13 = ($X1 / 15) * 3;
	$X12 = ($X1 / 15) * 4;
	$X11 = ($X1 / 15) * 5;
	$X10 = ($X1 / 15) * 6;
	$X9 = ($X1 / 15) * 7;
	$X8 = ($X1 / 15) * 8;
	$X7 = ($X1 / 15) * 9;
	$X6 = ($X1 / 15) * 10;
	$X5 = ($X1 / 15) * 11;
	$X4 = ($X1 / 15) * 12;
	$X3 = ($X1 / 15) * 13;
	$X2 = ($X1 / 15) * 14;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@0,@0), テンポ, 待ち);

}

//――――――――――――――――――――――――――――――――――――――//
.....//Ｙ均等
//――――――――――――――――――――――――――――――――――――――//

function FadeYH("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 3) * 1;
	$Y3 = ($Y1 / 3) * 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y1), テンポ, 待ち);
}

function FadeYH2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 6) * 1;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y1), テンポ, 待ち);

}

function FadeYH3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 9) * 1;
	$Y3 = ($Y1 / 9) * 2;
	$Y4 = ($Y1 / 9) * 3;
	$Y5 = ($Y1 / 9) * 4;
	$Y6 = ($Y1 / 9) * 5;
	$Y7 = ($Y1 / 9) * 6;
	$Y8 = ($Y1 / 9) * 7;
	$Y9 = ($Y1 / 9) * 8;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y1), テンポ, 待ち);

}

function FadeYH4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 12) * 1;
	$Y3 = ($Y1 / 12) * 2;
	$Y4 = ($Y1 / 12) * 3;
	$Y5 = ($Y1 / 12) * 4;
	$Y6 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y8 = ($Y1 / 12) * 7;
	$Y9 = ($Y1 / 12) * 8;
	$Y10 = ($Y1 / 12) * 9;
	$Y11 = ($Y1 / 12) * 10;
	$Y12 = ($Y1 / 12) * 11;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@$Y1), テンポ, 待ち);

}

function FadeYH5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 15) * 1;
	$Y3 = ($Y1 / 15) * 2;
	$Y4 = ($Y1 / 15) * 3;
	$Y5 = ($Y1 / 15) * 4;
	$Y6 = ($Y1 / 15) * 5;
	$Y7 = ($Y1 / 15) * 6;
	$Y8 = ($Y1 / 15) * 7;
	$Y9 = ($Y1 / 15) * 8;
	$Y10 = ($Y1 / 15) * 9;
	$Y11 = ($Y1 / 15) * 10;
	$Y12 = ($Y1 / 15) * 11;
	$Y13 = ($Y1 / 15) * 12;
	$Y14 = ($Y1 / 15) * 13;
	$Y15 = ($Y1 / 15) * 14;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@$Y1), テンポ, 待ち);

}

//=============================================================================//

function FadeYHH("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y3 = ($Y1 / 3) * 1;
	$Y2 = ($Y1 / 3) * 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadeYHH2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y6 = ($Y1 / 6) * 1;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;
	$Y2 = ($Y1 / 6) * 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@0), テンポ, 待ち);

}

function FadeYHH3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y9 = ($Y1 / 9) * 1;
	$Y8 = ($Y1 / 9) * 2;
	$Y7 = ($Y1 / 9) * 3;
	$Y6 = ($Y1 / 9) * 4;
	$Y5 = ($Y1 / 9) * 5;
	$Y4 = ($Y1 / 9) * 6;
	$Y3 = ($Y1 / 9) * 7;
	$Y2 = ($Y1 / 9) * 8;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@0), テンポ, 待ち);

}

function FadeYHH4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y12 = ($Y1 / 12) * 1;
	$Y11 = ($Y1 / 12) * 2;
	$Y10 = ($Y1 / 12) * 3;
	$Y9 = ($Y1 / 12) * 4;
	$Y8 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y6 = ($Y1 / 12) * 7;
	$Y5 = ($Y1 / 12) * 8;
	$Y4 = ($Y1 / 12) * 9;
	$Y3 = ($Y1 / 12) * 10;
	$Y2 = ($Y1 / 12) * 11;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@0), テンポ, 待ち);

}

function FadeYHH5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y15 = ($Y1 / 15) * 1;
	$Y14 = ($Y1 / 15) * 2;
	$Y13 = ($Y1 / 15) * 3;
	$Y12 = ($Y1 / 15) * 4;
	$Y11 = ($Y1 / 15) * 5;
	$Y10 = ($Y1 / 15) * 6;
	$Y9 = ($Y1 / 15) * 7;
	$Y8 = ($Y1 / 15) * 8;
	$Y7 = ($Y1 / 15) * 9;
	$Y6 = ($Y1 / 15) * 10;
	$Y5 = ($Y1 / 15) * 11;
	$Y4 = ($Y1 / 15) * 12;
	$Y3 = ($Y1 / 15) * 13;
	$Y2 = ($Y1 / 15) * 14;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@0), テンポ, 待ち);

}


//――――――――――――――――――――――――――――――――――――――//
.....//Ⅹ縮む
//――――――――――――――――――――――――――――――――――――――//


function FadeXHC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 6) * 1;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	$Y2 = $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0), テンポ, 待ち);

}

function FadeXHC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 9) * 1;
	$X3 = ($X1 / 9) * 2;
	$X4 = ($X1 / 9) * 3;
	$X5 = ($X1 / 9) * 4;
	$X6 = ($X1 / 9) * 5;
	$X7 = ($X1 / 9) * 6;
	$X8 = ($X1 / 9) * 7;
	$X9 = ($X1 / 9) * 8;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X1,@0), テンポ, 待ち);

}

function FadeXHC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 12) * 1;
	$X3 = ($X1 / 12) * 2;
	$X4 = ($X1 / 12) * 3;
	$X5 = ($X1 / 12) * 4;
	$X6 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X8 = ($X1 / 12) * 7;
	$X9 = ($X1 / 12) * 8;
	$X10 = ($X1 / 12) * 9;
	$X11 = ($X1 / 12) * 10;
	$X12 = ($X1 / 12) * 11;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = $Y1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X1,@0), テンポ, 待ち);

}

function FadeXHC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 15) * 1;
	$X3 = ($X1 / 15) * 2;
	$X4 = ($X1 / 15) * 3;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 5;
	$X7 = ($X1 / 15) * 6;
	$X8 = ($X1 / 15) * 7;
	$X9 = ($X1 / 15) * 8;
	$X10 = ($X1 / 15) * 9;
	$X11 = ($X1 / 15) * 10;
	$X12 = ($X1 / 15) * 11;
	$X13 = ($X1 / 15) * 12;
	$X14 = ($X1 / 15) * 13;
	$X15 = ($X1 / 15) * 14;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = $Y1 / 4;
	$Y5 = $Y1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@$X1,@0), テンポ, 待ち);

}

//=============================================================================//


function FadeXHHC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = -$x;
	$Y1 = $y;

	$X6 = ($X1 / 6) * 1;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	$Y2 = $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@0,@0), テンポ, 待ち);

}

function FadeXHHC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X9 = ($X1 / 9) * 1;
	$X8 = ($X1 / 9) * 2;
	$X7 = ($X1 / 9) * 3;
	$X6 = ($X1 / 9) * 4;
	$X5 = ($X1 / 9) * 5;
	$X4 = ($X1 / 9) * 6;
	$X3 = ($X1 / 9) * 7;
	$X2 = ($X1 / 9) * 8;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@0,@0), テンポ, 待ち);

}

function FadeXHHC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X12 = ($X1 / 12) * 1;
	$X11 = ($X1 / 12) * 2;
	$X10 = ($X1 / 12) * 3;
	$X9 = ($X1 / 12) * 4;
	$X8 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X6 = ($X1 / 12) * 7;
	$X5 = ($X1 / 12) * 8;
	$X4 = ($X1 / 12) * 9;
	$X3 = ($X1 / 12) * 10;
	$X2 = ($X1 / 12) * 11;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = $Y1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@0,@0), テンポ, 待ち);

}

function FadeXHHC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X15 = ($X1 / 15) * 1;
	$X14 = ($X1 / 15) * 2;
	$X13 = ($X1 / 15) * 3;
	$X12 = ($X1 / 15) * 4;
	$X11 = ($X1 / 15) * 5;
	$X10 = ($X1 / 15) * 6;
	$X9 = ($X1 / 15) * 7;
	$X8 = ($X1 / 15) * 8;
	$X7 = ($X1 / 15) * 9;
	$X6 = ($X1 / 15) * 10;
	$X5 = ($X1 / 15) * 11;
	$X4 = ($X1 / 15) * 12;
	$X3 = ($X1 / 15) * 13;
	$X2 = ($X1 / 15) * 14;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = $Y1 / 4;
	$Y5 = $Y1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@0,@0), テンポ, 待ち);

}

//――――――――――――――――――――――――――――――――――――――//
.....//Ｙ縮む
//――――――――――――――――――――――――――――――――――――――//

function FadeYHC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 6) * 1;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 5;

	$X2 = $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 9) * 1;
	$Y3 = ($Y1 / 9) * 2;
	$Y4 = ($Y1 / 9) * 3;
	$Y5 = ($Y1 / 9) * 4;
	$Y6 = ($Y1 / 9) * 5;
	$Y7 = ($Y1 / 9) * 6;
	$Y8 = ($Y1 / 9) * 7;
	$Y9 = ($Y1 / 9) * 8;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 12) * 1;
	$Y3 = ($Y1 / 12) * 2;
	$Y4 = ($Y1 / 12) * 3;
	$Y5 = ($Y1 / 12) * 4;
	$Y6 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y8 = ($Y1 / 12) * 7;
	$Y9 = ($Y1 / 12) * 8;
	$Y10 = ($Y1 / 12) * 9;
	$Y11 = ($Y1 / 12) * 10;
	$Y12 = ($Y1 / 12) * 11;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = $X1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 15) * 1;
	$Y3 = ($Y1 / 15) * 2;
	$Y4 = ($Y1 / 15) * 3;
	$Y5 = ($Y1 / 15) * 4;
	$Y6 = ($Y1 / 15) * 5;
	$Y7 = ($Y1 / 15) * 6;
	$Y8 = ($Y1 / 15) * 7;
	$Y9 = ($Y1 / 15) * 8;
	$Y10 = ($Y1 / 15) * 9;
	$Y11 = ($Y1 / 15) * 10;
	$Y12 = ($Y1 / 15) * 11;
	$Y13 = ($Y1 / 15) * 12;
	$Y14 = ($Y1 / 15) * 13;
	$Y15 = ($Y1 / 15) * 14;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = $X1 / 4;
	$X5 = $X1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@$Y1), テンポ, 待ち);

}

//=============================================================================//


function FadeYHHC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y6 = ($Y1 / 6) * 1;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;
	$Y2 = ($Y1 / 6) * 5;

	$X2 = $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@0), テンポ, 待ち);

}

function FadeYHHC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y9 = ($Y1 / 9) * 1;
	$Y8 = ($Y1 / 9) * 2;
	$Y7 = ($Y1 / 9) * 3;
	$Y6 = ($Y1 / 9) * 4;
	$Y5 = ($Y1 / 9) * 5;
	$Y4 = ($Y1 / 9) * 6;
	$Y3 = ($Y1 / 9) * 7;
	$Y2 = ($Y1 / 9) * 8;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@0), テンポ, 待ち);

}

function FadeYHHC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y12 = ($Y1 / 12) * 1;
	$Y11 = ($Y1 / 12) * 2;
	$Y10 = ($Y1 / 12) * 3;
	$Y9 = ($Y1 / 12) * 4;
	$Y8 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y6 = ($Y1 / 12) * 7;
	$Y5 = ($Y1 / 12) * 8;
	$Y4 = ($Y1 / 12) * 9;
	$Y3 = ($Y1 / 12) * 10;
	$Y2 = ($Y1 / 12) * 11;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = $X1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@0), テンポ, 待ち);

}

function FadeYHHC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y15 = ($Y1 / 15) * 1;
	$Y14 = ($Y1 / 15) * 2;
	$Y13 = ($Y1 / 15) * 3;
	$Y12 = ($Y1 / 15) * 4;
	$Y11 = ($Y1 / 15) * 5;
	$Y10 = ($Y1 / 15) * 6;
	$Y9 = ($Y1 / 15) * 7;
	$Y8 = ($Y1 / 15) * 8;
	$Y7 = ($Y1 / 15) * 9;
	$Y6 = ($Y1 / 15) * 10;
	$Y5 = ($Y1 / 15) * 11;
	$Y4 = ($Y1 / 15) * 12;
	$Y3 = ($Y1 / 15) * 13;
	$Y2 = ($Y1 / 15) * 14;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = $X1 / 4;
	$X5 = $X1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@0), テンポ, 待ち);

}


//――――――――――――――――――――――――――――――――――――――//
.....//Ⅹ伸びる
//――――――――――――――――――――――――――――――――――――――//

function FadeXHE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 6) * 1;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	$Y2 = $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXHE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 9) * 1;
	$X3 = ($X1 / 9) * 2;
	$X4 = ($X1 / 9) * 3;
	$X5 = ($X1 / 9) * 4;
	$X6 = ($X1 / 9) * 5;
	$X7 = ($X1 / 9) * 6;
	$X8 = ($X1 / 9) * 7;
	$X9 = ($X1 / 9) * 8;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y3}{@$X3,@$Y3}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXHE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 12) * 1;
	$X3 = ($X1 / 12) * 2;
	$X4 = ($X1 / 12) * 3;
	$X5 = ($X1 / 12) * 4;
	$X6 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X8 = ($X1 / 12) * 7;
	$X9 = ($X1 / 12) * 8;
	$X10 = ($X1 / 12) * 9;
	$X11 = ($X1 / 12) * 10;
	$X12 = ($X1 / 12) * 11;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = $Y1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y4}{@$X3,@$Y4}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y3}(@$X7,@0){@$X8,@$Y2}{@$X9,@$Y2}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXHE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 15) * 1;
	$X3 = ($X1 / 15) * 2;
	$X4 = ($X1 / 15) * 3;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 5;
	$X7 = ($X1 / 15) * 6;
	$X8 = ($X1 / 15) * 7;
	$X9 = ($X1 / 15) * 8;
	$X10 = ($X1 / 15) * 9;
	$X11 = ($X1 / 15) * 10;
	$X12 = ($X1 / 15) * 11;
	$X13 = ($X1 / 15) * 12;
	$X14 = ($X1 / 15) * 13;
	$X15 = ($X1 / 15) * 14;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = $Y1 / 4;
	$Y5 = $Y1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y5}{@$X3,@$Y5}(@$X4,@0){@$X5,@$Y4}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y2}{@$X12,@$Y2}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@$X1,@0), テンポ, 待ち);

}

//=============================================================================//


function FadeXHHE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = -$x;
	$Y1 = $y;

	$X6 = ($X1 / 6) * 1;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	$Y2 = $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y2}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHHE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X9 = ($X1 / 9) * 1;
	$X8 = ($X1 / 9) * 2;
	$X7 = ($X1 / 9) * 3;
	$X6 = ($X1 / 9) * 4;
	$X5 = ($X1 / 9) * 5;
	$X4 = ($X1 / 9) * 6;
	$X3 = ($X1 / 9) * 7;
	$X2 = ($X1 / 9) * 8;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y3}{@$X3,@$Y3}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHHE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X12 = ($X1 / 12) * 1;
	$X11 = ($X1 / 12) * 2;
	$X10 = ($X1 / 12) * 3;
	$X9 = ($X1 / 12) * 4;
	$X8 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X6 = ($X1 / 12) * 7;
	$X5 = ($X1 / 12) * 8;
	$X4 = ($X1 / 12) * 9;
	$X3 = ($X1 / 12) * 10;
	$X2 = ($X1 / 12) * 11;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = $Y1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y4}{@$X3,@$Y4}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y3}(@$X7,@0){@$X8,@$Y2}{@$X9,@$Y2}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHHE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X15 = ($X1 / 15) * 1;
	$X14 = ($X1 / 15) * 2;
	$X13 = ($X1 / 15) * 3;
	$X12 = ($X1 / 15) * 4;
	$X11 = ($X1 / 15) * 5;
	$X10 = ($X1 / 15) * 6;
	$X9 = ($X1 / 15) * 7;
	$X8 = ($X1 / 15) * 8;
	$X7 = ($X1 / 15) * 9;
	$X6 = ($X1 / 15) * 10;
	$X5 = ($X1 / 15) * 11;
	$X4 = ($X1 / 15) * 12;
	$X3 = ($X1 / 15) * 13;
	$X2 = ($X1 / 15) * 14;

	$Y2 = $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = $Y1 / 4;
	$Y5 = $Y1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y5}{@$X3,@$Y5}(@$X4,@0){@$X5,@$Y4}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y2}{@$X12,@$Y2}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@0,@0), テンポ, 待ち);

}

//――――――――――――――――――――――――――――――――――――――//
.....//Ｙ伸びる
//――――――――――――――――――――――――――――――――――――――//

function FadeYHE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 6) * 1;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 5;

	$X2 = $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X2,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 9) * 1;
	$Y3 = ($Y1 / 9) * 2;
	$Y4 = ($Y1 / 9) * 3;
	$Y5 = ($Y1 / 9) * 4;
	$Y6 = ($Y1 / 9) * 5;
	$Y7 = ($Y1 / 9) * 6;
	$Y8 = ($Y1 / 9) * 7;
	$Y9 = ($Y1 / 9) * 8;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X3,@$Y2}{@$X3,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 12) * 1;
	$Y3 = ($Y1 / 12) * 2;
	$Y4 = ($Y1 / 12) * 3;
	$Y5 = ($Y1 / 12) * 4;
	$Y6 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y8 = ($Y1 / 12) * 7;
	$Y9 = ($Y1 / 12) * 8;
	$Y10 = ($Y1 / 12) * 9;
	$Y11 = ($Y1 / 12) * 10;
	$Y12 = ($Y1 / 12) * 11;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = $X1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X4,@$Y2}{@$X4,@$Y3}(@0,@$Y4){@$X3,@$Y5}{@$X3,@$Y6}(@0,@$Y7){@$X2,@$Y8}{@$X2,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 15) * 1;
	$Y3 = ($Y1 / 15) * 2;
	$Y4 = ($Y1 / 15) * 3;
	$Y5 = ($Y1 / 15) * 4;
	$Y6 = ($Y1 / 15) * 5;
	$Y7 = ($Y1 / 15) * 6;
	$Y8 = ($Y1 / 15) * 7;
	$Y9 = ($Y1 / 15) * 8;
	$Y10 = ($Y1 / 15) * 9;
	$Y11 = ($Y1 / 15) * 10;
	$Y12 = ($Y1 / 15) * 11;
	$Y13 = ($Y1 / 15) * 12;
	$Y14 = ($Y1 / 15) * 13;
	$Y15 = ($Y1 / 15) * 14;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = $X1 / 4;
	$X5 = $X1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X5,@$Y2}{@$X5,@$Y3}(@0,@$Y4){@$X4,@$Y5}{@$X4,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X2,@$Y11}{@$X2,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@$Y1), テンポ, 待ち);

}

//=============================================================================//


function FadeYHHE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y6 = ($Y1 / 6) * 1;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;
	$Y2 = ($Y1 / 6) * 5;

	$X2 = $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X2,@$Y2}{@$X2,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@0), テンポ, 待ち);

}

function FadeYHHE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y9 = ($Y1 / 9) * 1;
	$Y8 = ($Y1 / 9) * 2;
	$Y7 = ($Y1 / 9) * 3;
	$Y6 = ($Y1 / 9) * 4;
	$Y5 = ($Y1 / 9) * 5;
	$Y4 = ($Y1 / 9) * 6;
	$Y3 = ($Y1 / 9) * 7;
	$Y2 = ($Y1 / 9) * 8;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X3,@$Y2}{@$X3,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@0), テンポ, 待ち);

}

function FadeYHHE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y12 = ($Y1 / 12) * 1;
	$Y11 = ($Y1 / 12) * 2;
	$Y10 = ($Y1 / 12) * 3;
	$Y9 = ($Y1 / 12) * 4;
	$Y8 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y6 = ($Y1 / 12) * 7;
	$Y5 = ($Y1 / 12) * 8;
	$Y4 = ($Y1 / 12) * 9;
	$Y3 = ($Y1 / 12) * 10;
	$Y2 = ($Y1 / 12) * 11;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = $X1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X4,@$Y2}{@$X4,@$Y3}(@0,@$Y4){@$X3,@$Y5}{@$X3,@$Y6}(@0,@$Y7){@$X2,@$Y8}{@$X2,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@0), テンポ, 待ち);

}

function FadeYHHE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y15 = ($Y1 / 15) * 1;
	$Y14 = ($Y1 / 15) * 2;
	$Y13 = ($Y1 / 15) * 3;
	$Y12 = ($Y1 / 15) * 4;
	$Y11 = ($Y1 / 15) * 5;
	$Y10 = ($Y1 / 15) * 6;
	$Y9 = ($Y1 / 15) * 7;
	$Y8 = ($Y1 / 15) * 8;
	$Y7 = ($Y1 / 15) * 9;
	$Y6 = ($Y1 / 15) * 10;
	$Y5 = ($Y1 / 15) * 11;
	$Y4 = ($Y1 / 15) * 12;
	$Y3 = ($Y1 / 15) * 13;
	$Y2 = ($Y1 / 15) * 14;

	$X2 = $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = $X1 / 4;
	$X5 = $X1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X5,@$Y2}{@$X5,@$Y3}(@0,@$Y4){@$X4,@$Y5}{@$X4,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X2,@$Y11}{@$X2,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@0), テンポ, 待ち);

}


//――――――――――――――――――――――――――――――――――――――//
.....//Ⅹランダム
//――――――――――――――――――――――――――――――――――――――//

function FadeXHR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 6) * 1;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	$Y1 = Random($y);
	$Y2 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXHR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 9) * 1;
	$X3 = ($X1 / 9) * 2;
	$X4 = ($X1 / 9) * 3;
	$X5 = ($X1 / 9) * 4;
	$X6 = ($X1 / 9) * 5;
	$X7 = ($X1 / 9) * 6;
	$X8 = ($X1 / 9) * 7;
	$X9 = ($X1 / 9) * 8;

	$Y1 = Random($y);
	$Y2 = Random($y);
	$Y3 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y3}{@$X3,@$Y3}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXHR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 12) * 1;
	$X3 = ($X1 / 12) * 2;
	$X4 = ($X1 / 12) * 3;
	$X5 = ($X1 / 12) * 4;
	$X6 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X8 = ($X1 / 12) * 7;
	$X9 = ($X1 / 12) * 8;
	$X10 = ($X1 / 12) * 9;
	$X11 = ($X1 / 12) * 10;
	$X12 = ($X1 / 12) * 11;

	$Y1 = Random($y);
	$Y2 = Random($y);
	$Y3 = Random($y);
	$Y4 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y4}{@$X3,@$Y4}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y3}(@$X7,@0){@$X8,@$Y2}{@$X9,@$Y2}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@$X1,@0), テンポ, 待ち);

}

function FadeXHR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 15) * 1;
	$X3 = ($X1 / 15) * 2;
	$X4 = ($X1 / 15) * 3;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 5;
	$X7 = ($X1 / 15) * 6;
	$X8 = ($X1 / 15) * 7;
	$X9 = ($X1 / 15) * 8;
	$X10 = ($X1 / 15) * 9;
	$X11 = ($X1 / 15) * 10;
	$X12 = ($X1 / 15) * 11;
	$X13 = ($X1 / 15) * 12;
	$X14 = ($X1 / 15) * 13;
	$X15 = ($X1 / 15) * 14;

	$Y1 = Random($y);
	$Y2 = Random($y);
	$Y3 = Random($y);
	$Y4 = Random($y);
	$Y5 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y5}{@$X3,@$Y5}(@$X4,@0){@$X5,@$Y4}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y2}{@$X12,@$Y2}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@$X1,@0), テンポ, 待ち);

}

//=============================================================================//


function FadeXHHR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = -$x;
	$X6 = ($X1 / 6) * 1;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	$Y1 = Random($y);
	$Y2 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y2}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHHR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X9 = ($X1 / 9) * 1;
	$X8 = ($X1 / 9) * 2;
	$X7 = ($X1 / 9) * 3;
	$X6 = ($X1 / 9) * 4;
	$X5 = ($X1 / 9) * 5;
	$X4 = ($X1 / 9) * 6;
	$X3 = ($X1 / 9) * 7;
	$X2 = ($X1 / 9) * 8;

	$Y1 = Random($y);
	$Y2 = Random($y);
	$Y3 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y3}{@$X3,@$Y3}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHHR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X12 = ($X1 / 12) * 1;
	$X11 = ($X1 / 12) * 2;
	$X10 = ($X1 / 12) * 3;
	$X9 = ($X1 / 12) * 4;
	$X8 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X6 = ($X1 / 12) * 7;
	$X5 = ($X1 / 12) * 8;
	$X4 = ($X1 / 12) * 9;
	$X3 = ($X1 / 12) * 10;
	$X2 = ($X1 / 12) * 11;

	$Y1 = Random($y);
	$Y2 = Random($y);
	$Y3 = Random($y);
	$Y4 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y4}{@$X3,@$Y4}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y3}(@$X7,@0){@$X8,@$Y2}{@$X9,@$Y2}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@0,@0), テンポ, 待ち);

}

function FadeXHHR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X15 = ($X1 / 15) * 1;
	$X14 = ($X1 / 15) * 2;
	$X13 = ($X1 / 15) * 3;
	$X12 = ($X1 / 15) * 4;
	$X11 = ($X1 / 15) * 5;
	$X10 = ($X1 / 15) * 6;
	$X9 = ($X1 / 15) * 7;
	$X8 = ($X1 / 15) * 8;
	$X7 = ($X1 / 15) * 9;
	$X6 = ($X1 / 15) * 10;
	$X5 = ($X1 / 15) * 11;
	$X4 = ($X1 / 15) * 12;
	$X3 = ($X1 / 15) * 13;
	$X2 = ($X1 / 15) * 14;

	$Y1 = Random($y);
	$Y2 = Random($y);
	$Y3 = Random($y);
	$Y4 = Random($y);
	$Y5 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y5}{@$X3,@$Y5}(@$X4,@0){@$X5,@$Y4}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y2}{@$X12,@$Y2}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@0,@0), テンポ, 待ち);

}

//――――――――――――――――――――――――――――――――――――――//
.....//Ｙランダム
//――――――――――――――――――――――――――――――――――――――//

function FadeYHR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = ($Y1 / 6) * 1;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 5;

	$X1 = Random($x);
	$X2 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X2,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = ($Y1 / 9) * 1;
	$Y3 = ($Y1 / 9) * 2;
	$Y4 = ($Y1 / 9) * 3;
	$Y5 = ($Y1 / 9) * 4;
	$Y6 = ($Y1 / 9) * 5;
	$Y7 = ($Y1 / 9) * 6;
	$Y8 = ($Y1 / 9) * 7;
	$Y9 = ($Y1 / 9) * 8;

	$X1 = Random($x);
	$X2 = Random($x);
	$X3 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X3,@$Y2}{@$X3,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 12) * 1;
	$Y3 = ($Y1 / 12) * 2;
	$Y4 = ($Y1 / 12) * 3;
	$Y5 = ($Y1 / 12) * 4;
	$Y6 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y8 = ($Y1 / 12) * 7;
	$Y9 = ($Y1 / 12) * 8;
	$Y10 = ($Y1 / 12) * 9;
	$Y11 = ($Y1 / 12) * 10;
	$Y12 = ($Y1 / 12) * 11;

	$X1 = Random($x);
	$X2 = Random($x);
	$X3 = Random($x);
	$X4 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X4,@$Y2}{@$X4,@$Y3}(@0,@$Y4){@$X3,@$Y5}{@$X3,@$Y6}(@0,@$Y7){@$X2,@$Y8}{@$X2,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@$Y1), テンポ, 待ち);

}

function FadeYHR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$Y2 = ($Y1 / 15) * 1;
	$Y3 = ($Y1 / 15) * 2;
	$Y4 = ($Y1 / 15) * 3;
	$Y5 = ($Y1 / 15) * 4;
	$Y6 = ($Y1 / 15) * 5;
	$Y7 = ($Y1 / 15) * 6;
	$Y8 = ($Y1 / 15) * 7;
	$Y9 = ($Y1 / 15) * 8;
	$Y10 = ($Y1 / 15) * 9;
	$Y11 = ($Y1 / 15) * 10;
	$Y12 = ($Y1 / 15) * 11;
	$Y13 = ($Y1 / 15) * 12;
	$Y14 = ($Y1 / 15) * 13;
	$Y15 = ($Y1 / 15) * 14;

	$X1 = Random($x);
	$X2 = Random($x);
	$X3 = Random($x);
	$X4 = Random($x);
	$X5 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X5,@$Y2}{@$X5,@$Y3}(@0,@$Y4){@$X4,@$Y5}{@$X4,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X2,@$Y11}{@$X2,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@$Y1), テンポ, 待ち);

}

//=============================================================================//

function FadeYHHR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y6 = ($Y1 / 6) * 1;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;
	$Y2 = ($Y1 / 6) * 5;

	$X1 = Random($x);
	$X2 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X2,@$Y2}{@$X2,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@0), テンポ, 待ち);

}

function FadeYHHR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y9 = ($Y1 / 9) * 1;
	$Y8 = ($Y1 / 9) * 2;
	$Y7 = ($Y1 / 9) * 3;
	$Y6 = ($Y1 / 9) * 4;
	$Y5 = ($Y1 / 9) * 5;
	$Y4 = ($Y1 / 9) * 6;
	$Y3 = ($Y1 / 9) * 7;
	$Y2 = ($Y1 / 9) * 8;

	$X1 = Random($x);
	$X2 = Random($x);
	$X3 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X3,@$Y2}{@$X3,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@0), テンポ, 待ち);

}

function FadeYHHR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y12 = ($Y1 / 12) * 1;
	$Y11 = ($Y1 / 12) * 2;
	$Y10 = ($Y1 / 12) * 3;
	$Y9 = ($Y1 / 12) * 4;
	$Y8 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y6 = ($Y1 / 12) * 7;
	$Y5 = ($Y1 / 12) * 8;
	$Y4 = ($Y1 / 12) * 9;
	$Y3 = ($Y1 / 12) * 10;
	$Y2 = ($Y1 / 12) * 11;

	$X1 = Random($x);
	$X2 = Random($x);
	$X3 = Random($x);
	$X4 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X4,@$Y2}{@$X4,@$Y3}(@0,@$Y4){@$X3,@$Y5}{@$X3,@$Y6}(@0,@$Y7){@$X2,@$Y8}{@$X2,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@0), テンポ, 待ち);

}

function FadeYHHR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = - $y;

	$Y15 = ($Y1 / 15) * 1;
	$Y14 = ($Y1 / 15) * 2;
	$Y13 = ($Y1 / 15) * 3;
	$Y12 = ($Y1 / 15) * 4;
	$Y11 = ($Y1 / 15) * 5;
	$Y10 = ($Y1 / 15) * 6;
	$Y9 = ($Y1 / 15) * 7;
	$Y8 = ($Y1 / 15) * 8;
	$Y7 = ($Y1 / 15) * 9;
	$Y6 = ($Y1 / 15) * 10;
	$Y5 = ($Y1 / 15) * 11;
	$Y4 = ($Y1 / 15) * 12;
	$Y3 = ($Y1 / 15) * 13;
	$Y2 = ($Y1 / 15) * 14;

	$X1 = Random($x);
	$X2 = Random($x);
	$X3 = Random($x);
	$X4 = Random($x);
	$X5 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X5,@$Y2}{@$X5,@$Y3}(@0,@$Y4){@$X4,@$Y5}{@$X4,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X2,@$Y11}{@$X2,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@0), テンポ, 待ち);

}

//――――――――――――――――――――――――――――――――――――――//
....//マウント移動
//――――――――――――――――――――――――――――――――――――――//
//――――――――――――――――――――――――――――――――――――――//
.....//Ⅹ均等
//――――――――――――――――――――――――――――――――――――――//

function FadeXM("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 6) * 1;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X1,@0), テンポ, 待ち);
}

function FadeXM1("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 18) * 1;
	$X3 = ($X1 / 18) * 2;
	$X4 = ($X1 / 18) * 3;

	$X5 = ($X1 / 18) * 7;
	$X6 = ($X1 / 18) * 11;
	$X7 = ($X1 / 18) * 15;

	$X8 = ($X1 / 18) * 16;
	$X9 = ($X1 / 18) * 17;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X1,@0), テンポ, 待ち);
}

function FadeXM2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 30) * 1;
	$X3 = ($X1 / 30) * 2;
	$X4 = ($X1 / 30) * 3;

	$X5 = ($X1 / 30) * 7;
	$X6 = ($X1 / 30) * 11;
	$X7 = ($X1 / 30) * 15;

	$X8 = ($X1 / 30) * 19;
	$X9 = ($X1 / 30) * 23;
	$X10 = ($X1 / 30) * 27;

	$X11 = ($X1 / 30) * 28;
	$X12 = ($X1 / 30) * 29;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X10,@$Y1){@$X11,@0}{@$X12,@0}(@$X1,@0), テンポ, 待ち);
}

function FadeXM3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 42) * 1;
	$X3 = ($X1 / 42) * 2;
	$X4 = ($X1 / 42) * 3;

	$X5 = ($X1 / 42) * 7;
	$X6 = ($X1 / 42) * 11;
	$X7 = ($X1 / 42) * 15;

	$X8 = ($X1 / 42) * 19;
	$X9 = ($X1 / 42) * 23;
	$X10 = ($X1 / 42) * 27;

	$X11 = ($X1 / 42) * 31;
	$X12 = ($X1 / 42) * 35;
	$X13 = ($X1 / 42) * 39;

	$X14 = ($X1 / 42) * 40;
	$X15 = ($X1 / 42) * 41;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X10,@$Y1){@$X11,@0}{@$X12,@0}(@$X13,@$Y1){@$X14,@0}{@$X15,@0}(@$X1,@0), テンポ, 待ち);
}

function FadeXM4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 54) * 1;
	$X3 = ($X1 / 54) * 2;
	$X4 = ($X1 / 54) * 3;

	$X5 = ($X1 / 54) * 7;
	$X6 = ($X1 / 54) * 11;
	$X7 = ($X1 / 54) * 15;

	$X8 = ($X1 / 54) * 19;
	$X9 = ($X1 / 54) * 23;
	$X10 = ($X1 / 54) * 27;

	$X11 = ($X1 / 54) * 31;
	$X12 = ($X1 / 54) * 35;
	$X13 = ($X1 / 54) * 39;

	$X14 = ($X1 / 54) * 43;
	$X15 = ($X1 / 54) * 47;
	$X16 = ($X1 / 54) * 51;

	$X17 = ($X1 / 54) * 52;
	$X18 = ($X1 / 54) * 53;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X10,@$Y1){@$X11,@0}{@$X12,@0}(@$X13,@$Y1){@$X14,@0}{@$X15,@0}(@$X16,@$Y1){@$X17,@0}{@$X18,@0}(@$X1,@0), テンポ, 待ち);
}

function FadeXM5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 66) * 1;
	$X3 = ($X1 / 66) * 2;
	$X4 = ($X1 / 66) * 3;

	$X5 = ($X1 / 66) * 7;
	$X6 = ($X1 / 66) * 11;
	$X7 = ($X1 / 66) * 15;

	$X8 = ($X1 / 66) * 19;
	$X9 = ($X1 / 66) * 23;
	$X10 = ($X1 / 66) * 27;

	$X11 = ($X1 / 66) * 31;
	$X12 = ($X1 / 66) * 35;
	$X13 = ($X1 / 66) * 39;

	$X14 = ($X1 / 66) * 43;
	$X15 = ($X1 / 66) * 47;
	$X16 = ($X1 / 66) * 51;

	$X17 = ($X1 / 66) * 55;
	$X18 = ($X1 / 66) * 59;
	$X19 = ($X1 / 66) * 63;

	$X20 = ($X1 / 66) * 64;
	$X21 = ($X1 / 66) * 65;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X10,@$Y1){@$X11,@0}{@$X12,@0}(@$X13,@$Y1){@$X14,@0}{@$X15,@0}(@$X16,@$Y1){@$X17,@0}{@$X18,@0}(@$X19,@$Y1){@$X20,@0}{@$X21,@0}(@$X1,@0), テンポ, 待ち);
}

//=============================================================================//

function FadeXMM("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X6 = ($X1 / 6) * 1;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@0,@0), テンポ, 待ち);
}

function FadeXMM1("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X9 = ($X1 / 18) * 1;
	$X8 = ($X1 / 18) * 2;
	$X7 = ($X1 / 18) * 3;

	$X6 = ($X1 / 18) * 7;
	$X5 = ($X1 / 18) * 11;
	$X4 = ($X1 / 18) * 15;

	$X3 = ($X1 / 18) * 16;
	$X2 = ($X1 / 18) * 17;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@0,@0), テンポ, 待ち);
}

function FadeXMM2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X12 = ($X1 / 30) * 1;
	$X11 = ($X1 / 30) * 2;
	$X10 = ($X1 / 30) * 3;

	$X9 = ($X1 / 30) * 7;
	$X8 = ($X1 / 30) * 11;
	$X7 = ($X1 / 30) * 15;

	$X6 = ($X1 / 30) * 19;
	$X5 = ($X1 / 30) * 23;
	$X4 = ($X1 / 30) * 27;

	$X3 = ($X1 / 30) * 28;
	$X2 = ($X1 / 30) * 29;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X10,@$Y1){@$X11,@0}{@$X12,@0}(@0,@0), テンポ, 待ち);
}

function FadeXMM3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X15 = ($X1 / 42) * 1;
	$X14 = ($X1 / 42) * 2;
	$X13 = ($X1 / 42) * 3;

	$X12 = ($X1 / 42) * 7;
	$X11= ($X1 / 42) * 11;
	$X10 = ($X1 / 42) * 15;

	$X9 = ($X1 / 42) * 19;
	$X8 = ($X1 / 42) * 23;
	$X7 = ($X1 / 42) * 27;

	$X6 = ($X1 / 42) * 31;
	$X5 = ($X1 / 42) * 35;
	$X4 = ($X1 / 42) * 39;

	$X3 = ($X1 / 42) * 40;
	$X2 = ($X1 / 42) * 41;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X10,@$Y1){@$X11,@0}{@$X12,@0}(@$X13,@$Y1){@$X14,@0}{@$X15,@0}(@0,@0), テンポ, 待ち);
}

function FadeXMM4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X18 = ($X1 / 54) * 1;
	$X17 = ($X1 / 54) * 2;
	$X16 = ($X1 / 54) * 3;

	$X15 = ($X1 / 54) * 7;
	$X14 = ($X1 / 54) * 11;
	$X13 = ($X1 / 54) * 15;

	$X12 = ($X1 / 54) * 19;
	$X11 = ($X1 / 54) * 23;
	$X10 = ($X1 / 54) * 27;

	$X9 = ($X1 / 54) * 31;
	$X8 = ($X1 / 54) * 35;
	$X7 = ($X1 / 54) * 39;

	$X6 = ($X1 / 54) * 43;
	$X5 = ($X1 / 54) * 47;
	$X4 = ($X1 / 54) * 51;

	$X3 = ($X1 / 54) * 52;
	$X2 = ($X1 / 54) * 53;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X10,@$Y1){@$X11,@0}{@$X12,@0}(@$X13,@$Y1){@$X14,@0}{@$X15,@0}(@$X16,@$Y1){@$X17,@0}{@$X18,@0}(@0,@0), テンポ, 待ち);
}

function FadeXMM5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = $y;

	$X21 = ($X1 / 66) * 1;
	$X20 = ($X1 / 66) * 2;
	$X19 = ($X1 / 66) * 3;

	$X18 = ($X1 / 66) * 7;
	$X17 = ($X1 / 66) * 11;
	$X16 = ($X1 / 66) * 15;

	$X15 = ($X1 / 66) * 19;
	$X14 = ($X1 / 66) * 23;
	$X13 = ($X1 / 66) * 27;

	$X12 = ($X1 / 66) * 31;
	$X11 = ($X1 / 66) * 35;
	$X10 = ($X1 / 66) * 39;

	$X9 = ($X1 / 66) * 43;
	$X8 = ($X1 / 66) * 47;
	$X7 = ($X1 / 66) * 51;

	$X6 = ($X1 / 66) * 55;
	$X5 = ($X1 / 66) * 59;
	$X4 = ($X1 / 66) * 63;

	$X3 = ($X1 / 66) * 64;
	$X2 = ($X1 / 66) * 65;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@0}{@$X3,@0}(@$X4,@$Y1){@$X5,@0}{@$X6,@0}(@$X7,@$Y1){@$X8,@0}{@$X9,@0}(@$X10,@$Y1){@$X11,@0}{@$X12,@0}(@$X13,@$Y1){@$X14,@0}{@$X15,@0}(@$X16,@$Y1){@$X17,@0}{@$X18,@0}(@$X19,@$Y1){@$X20,@0}{@$X21,@0}(@0,@0), テンポ, 待ち);
}

//――――――――――――――――――――――――――――――――――――――//
....//軸ずらし
//――――――――――――――――――――――――――――――――――――――//
//――――――――――――――――――――――――――――――――――――――//
.....//Ⅹ
//――――――――――――――――――――――――――――――――――――――//

function FadeXD("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;

	$Y1 = $y;
	$Y2 = $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X3,@0}{@$X4,@0}(@$X4,@$Y2){@$X4,@$Y1}{@$X5,@$Y1}(@$X1,@$Y1), テンポ, 待ち);
}

function FadeXDD("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;

	$Y1 = - $y;
	$Y2 = $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X3,@$Y1}{@$X4,@$Y1}(@$X4,@$Y2){@$X4,@0}{@$X5,@0}(@0,@0), テンポ, 待ち);
}

function FadeYD("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;

	$X1 = $x;
	$X2 = $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@0,@$Y3}{@0,@$Y4}(@$X2,@$Y4){@$X1,@$Y4}{@$X1,@$Y5}(@$X1,@$Y1), テンポ, 待ち);
}

function FadeYDD("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;

	$X1 = - $x;
	$X2 = $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X1,@$Y3}{@$X1,@$Y4}(@$X2,@$Y4){@0,@$Y4}{@0,@$Y5}(@0,@0), テンポ, 待ち);

}

//――――――――――――――――――――――――――――――――――――――//
....//放物線出
//――――――――――――――――――――――――――――――――――――――//
//――――――――――――――――――――――――――――――――――――――//
.....//Ⅹ
//――――――――――――――――――――――――――――――――――――――//

function FadeXU("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 3) * 1;
	$X3 = ($X1 / 3) * 2;

	$Y1 = $y;
	$Z1 = $z;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X1,@$Z1), テンポ, 待ち);
}


function FadeXUU("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = - $x;
	$X3 = ($X1 / 3) * 1;
	$X2 = ($X1 / 3) * 2;

	$Y1 = $y;
	$Z1 = - $z;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Z1){@$X2,@$Y1}{@$X3,@$Y1}(@0,@0), テンポ, 待ち);
}


//――――――――――――――――――――――――――――――――――――――//
.....//Ｙ
//――――――――――――――――――――――――――――――――――――――//

function FadeYU("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = ($Y1 / 3) * 1;
	$Y3 = ($Y1 / 3) * 2;

	$X1 = $x;
	$Z1 = $z;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@$Z1,@$Y1), テンポ, 待ち);
}

function FadeYUU("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y3 = ($Y1 / 3) * 1;
	$Y2 = ($Y1 / 3) * 2;

	$X1 = $x;
	$Z1 = - $z;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$Z1,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
....//波状移動
//―――――――――――――――――――――――――――――――――――――――
//―――――――――――――――――――――――――――――――――――――――
.....//Ⅹ均等
//―――――――――――――――――――――――――――――――――――――――

function FadeXW2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 6;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	$Y1 = $y;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0), テンポ, 待ち);
}

function FadeXW3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 9;
	$X3 = ($X1 / 9) * 2;
	$X4 = ($X1 / 9) * 3;
	$X5 = ($X1 / 9) * 4;
	$X6 = ($X1 / 9) * 5;
	$X7 = ($X1 / 9) * 6;
	$X8 = ($X1 / 9) * 7;
	$X9 = ($X1 / 9) * 8;

	$Y1 = $y;
	$Y2 = - $y;
	$Y3 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X1,@0), テンポ, 待ち);
}

function FadeXW4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 12;
	$X3 = ($X1 / 12) * 2;
	$X4 = ($X1 / 12) * 3;
	$X5 = ($X1 / 12) * 4;
	$X6 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X8 = ($X1 / 12) * 7;
	$X9 = ($X1 / 12) * 8;
	$X10 = ($X1 / 12) * 9;
	$X11 = ($X1 / 12) * 10;
	$X12 = ($X1 / 12) * 11;

	$Y1 = $y;
	$Y2 = - $y;
	$Y3 = $y;
	$Y4 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X1,@0), テンポ, 待ち);
}

function FadeXW5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 15;
	$X3 = ($X1 / 15) * 2;
	$X4 = ($X1 / 15) * 3;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 5;
	$X7 = ($X1 / 15) * 6;
	$X8 = ($X1 / 15) * 7;
	$X9 = ($X1 / 15) * 8;
	$X10 = ($X1 / 15) * 9;
	$X11 = ($X1 / 15) * 10;
	$X12 = ($X1 / 15) * 11;
	$X13 = ($X1 / 15) * 12;
	$X14 = ($X1 / 15) * 13;
	$X15 = ($X1 / 15) * 14;

	$Y1 = $y;
	$Y2 = - $y;
	$Y3 = $y;
	$Y4 = - $y;
	$Y5 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@$X1,@0), テンポ, 待ち);
}

function FadeXW6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 18;
	$X3 = ($X1 / 18) * 2;
	$X4 = ($X1 / 18) * 3;
	$X5 = ($X1 / 18) * 4;
	$X6 = ($X1 / 18) * 5;
	$X7 = ($X1 / 18) * 6;
	$X8 = ($X1 / 18) * 7;
	$X9 = ($X1 / 18) * 8;
	$X10 = ($X1 / 18) * 9;
	$X11 = ($X1 / 18) * 10;
	$X12 = ($X1 / 18) * 11;
	$X13 = ($X1 / 18) * 12;
	$X14 = ($X1 / 18) * 13;
	$X15 = ($X1 / 18) * 14;
	$X16 = ($X1 / 18) * 15;
	$X17 = ($X1 / 18) * 16;
	$X18 = ($X1 / 18) * 17;

	$Y1 = $y;
	$Y2 = - $y;
	$Y3 = $y;
	$Y4 = - $y;
	$Y5 = $y;
	$Y6 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@$X16,@0){@$X17,@$Y6}{@$X18,@$Y6}(@$X1,@0), テンポ, 待ち);
}

//=============================================================================//

function FadeXWW2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X6 = $X1 / 6;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	$Y1 = $y;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadeXWW3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X9 = $X1 / 9;
	$X8 = ($X1 / 9) * 2;
	$X7 = ($X1 / 9) * 3;
	$X6 = ($X1 / 9) * 4;
	$X5 = ($X1 / 9) * 5;
	$X4 = ($X1 / 9) * 6;
	$X3 = ($X1 / 9) * 7;
	$X2 = ($X1 / 9) * 8;

	$Y1 = $y;
	$Y2 = - $y;
	$Y3 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadeXWW4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X12 = $X1 / 12;
	$X11 = ($X1 / 12) * 2;
	$X10 = ($X1 / 12) * 3;
	$X9 = ($X1 / 12) * 4;
	$X8 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X6 = ($X1 / 12) * 7;
	$X5 = ($X1 / 12) * 8;
	$X4 = ($X1 / 12) * 9;
	$X3 = ($X1 / 12) * 10;
	$X2 = ($X1 / 12) * 11;

	$Y1 = $y;
	$Y2 = - $y;
	$Y3 = $y;
	$Y4 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadeXWW5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X15 = $X1 / 15;
	$X14 = ($X1 / 15) * 2;
	$X13 = ($X1 / 15) * 3;
	$X12 = ($X1 / 15) * 4;
	$X11 = ($X1 / 15) * 5;
	$X10 = ($X1 / 15) * 6;
	$X9 = ($X1 / 15) * 7;
	$X8 = ($X1 / 15) * 8;
	$X7 = ($X1 / 15) * 9;
	$X6 = ($X1 / 15) * 10;
	$X5 = ($X1 / 15) * 11;
	$X4 = ($X1 / 15) * 12;
	$X3 = ($X1 / 15) * 13;
	$X2 = ($X1 / 15) * 14;

	$Y1 = $y;
	$Y2 = - $y;
	$Y3 = $y;
	$Y4 = - $y;
	$Y5 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadeXWW6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X18 = $X1 / 18;
	$X17 = ($X1 / 18) * 2;
	$X16 = ($X1 / 18) * 3;
	$X15 = ($X1 / 18) * 4;
	$X14 = ($X1 / 18) * 5;
	$X13 = ($X1 / 18) * 6;
	$X12 = ($X1 / 18) * 7;
	$X11 = ($X1 / 18) * 8;
	$X10 = ($X1 / 18) * 9;
	$X9 = ($X1 / 18) * 10;
	$X8 = ($X1 / 18) * 11;
	$X7 = ($X1 / 18) * 12;
	$X6 = ($X1 / 18) * 13;
	$X5 = ($X1 / 18) * 14;
	$X4 = ($X1 / 18) * 15;
	$X3 = ($X1 / 18) * 16;
	$X2 = ($X1 / 18) * 17;

	$Y1 = $y;
	$Y2 = - $y;
	$Y3 = $y;
	$Y4 = - $y;
	$Y5 = $y;
	$Y6 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@$X16,@0){@$X17,@$Y6}{@$X18,@$Y6}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
.....//Ｙ均等
//―――――――――――――――――――――――――――――――――――――――

function FadeYW2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 6;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 5;

	$X1 = $x;
	$X2 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1), テンポ, 待ち);
}

function FadeYW3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 9;
	$Y3 = ($Y1 / 9) * 2;
	$Y4 = ($Y1 / 9) * 3;
	$Y5 = ($Y1 / 9) * 4;
	$Y6 = ($Y1 / 9) * 5;
	$Y7 = ($Y1 / 9) * 6;
	$Y8 = ($Y1 / 9) * 7;
	$Y9 = ($Y1 / 9) * 8;

	$X1 = $x;
	$X2 = - $x;
	$X3 = $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y1), テンポ, 待ち);
}

function FadeYW4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 12;
	$Y3 = ($Y1 / 12) * 2;
	$Y4 = ($Y1 / 12) * 3;
	$Y5 = ($Y1 / 12) * 4;
	$Y6 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y8 = ($Y1 / 12) * 7;
	$Y9 = ($Y1 / 12) * 8;
	$Y10 = ($Y1 / 12) * 9;
	$Y11 = ($Y1 / 12) * 10;
	$Y12 = ($Y1 / 12) * 11;

	$X1 = $x;
	$X2 = - $x;
	$X3 = $x;
	$X4 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y1), テンポ, 待ち);
}

function FadeYW5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 15;
	$Y3 = ($Y1 / 15) * 2;
	$Y4 = ($Y1 / 15) * 3;
	$Y5 = ($Y1 / 15) * 4;
	$Y6 = ($Y1 / 15) * 5;
	$Y7 = ($Y1 / 15) * 6;
	$Y8 = ($Y1 / 15) * 7;
	$Y9 = ($Y1 / 15) * 8;
	$Y10 = ($Y1 / 15) * 9;
	$Y11 = ($Y1 / 15) * 10;
	$Y12 = ($Y1 / 15) * 11;
	$Y13 = ($Y1 / 15) * 12;
	$Y14 = ($Y1 / 15) * 13;
	$Y15 = ($Y1 / 15) * 14;

	$X1 = $x;
	$X2 = - $x;
	$X3 = $x;
	$X4 = - $x;
	$X5 = $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@$Y1), テンポ, 待ち);
}

function FadeYW6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 18;
	$Y3 = ($Y1 / 18) * 2;
	$Y4 = ($Y1 / 18) * 3;
	$Y5 = ($Y1 / 18) * 4;
	$Y6 = ($Y1 / 18) * 5;
	$Y7 = ($Y1 / 18) * 6;
	$Y8 = ($Y1 / 18) * 7;
	$Y9 = ($Y1 / 18) * 8;
	$Y10 = ($Y1 / 18) * 9;
	$Y11 = ($Y1 / 18) * 10;
	$Y12 = ($Y1 / 18) * 11;
	$Y13 = ($Y1 / 18) * 12;
	$Y14 = ($Y1 / 18) * 13;
	$Y15 = ($Y1 / 18) * 14;
	$Y16 = ($Y1 / 18) * 15;
	$Y17 = ($Y1 / 18) * 16;
	$Y18 = ($Y1 / 18) * 17;

	$X1 = $x;
	$X2 = - $x;
	$X3 = $x;
	$X4 = - $x;
	$X5 = $x;
	$X6 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@$Y16){@$X6,@$Y17}{@$X6,@$Y18}(@0,@$Y1), テンポ, 待ち);
}

//=============================================================================//

function FadeYWW2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y6 = $Y1 / 6;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;
	$Y2 = ($Y1 / 6) * 5;

	$X1 = $x;
	$X2 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadeYWW3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y9 = $Y1 / 9;
	$Y8 = ($Y1 / 9) * 2;
	$Y7 = ($Y1 / 9) * 3;
	$Y6 = ($Y1 / 9) * 4;
	$Y5 = ($Y1 / 9) * 5;
	$Y4 = ($Y1 / 9) * 6;
	$Y3 = ($Y1 / 9) * 7;
	$Y2 = ($Y1 / 9) * 8;

	$X1 = $x;
	$X2 = - $x;
	$X3 = $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadeYWW4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y12 = $Y1 / 12;
	$Y11 = ($Y1 / 12) * 2;
	$Y10 = ($Y1 / 12) * 3;
	$Y9 = ($Y1 / 12) * 4;
	$Y8 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y6 = ($Y1 / 12) * 7;
	$Y5 = ($Y1 / 12) * 8;
	$Y4 = ($Y1 / 12) * 9;
	$Y3 = ($Y1 / 12) * 10;
	$Y2 = ($Y1 / 12) * 11;

	$X1 = $x;
	$X2 = - $x;
	$X3 = $x;
	$X4 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@0), テンポ, 待ち);
}

function FadeYWW5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y15 = $Y1 / 15;
	$Y14 = ($Y1 / 15) * 2;
	$Y13 = ($Y1 / 15) * 3;
	$Y12 = ($Y1 / 15) * 4;
	$Y11 = ($Y1 / 15) * 5;
	$Y10 = ($Y1 / 15) * 6;
	$Y9 = ($Y1 / 15) * 7;
	$Y8 = ($Y1 / 15) * 8;
	$Y7 = ($Y1 / 15) * 9;
	$Y6 = ($Y1 / 15) * 10;
	$Y5 = ($Y1 / 15) * 11;
	$Y4 = ($Y1 / 15) * 12;
	$Y3 = ($Y1 / 15) * 13;
	$Y2 = ($Y1 / 15) * 14;

	$X1 = $x;
	$X2 = - $x;
	$X3 = $x;
	$X4 = - $x;
	$X5 = $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@0), テンポ, 待ち);
}

function FadeYWW6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y18 = $Y1 / 18;
	$Y17 = ($Y1 / 18) * 2;
	$Y16 = ($Y1 / 18) * 3;
	$Y15 = ($Y1 / 18) * 4;
	$Y14 = ($Y1 / 18) * 5;
	$Y13 = ($Y1 / 18) * 6;
	$Y12 = ($Y1 / 18) * 7;
	$Y11 = ($Y1 / 18) * 8;
	$Y10 = ($Y1 / 18) * 9;
	$Y9 = ($Y1 / 18) * 10;
	$Y8 = ($Y1 / 18) * 11;
	$Y7 = ($Y1 / 18) * 12;
	$Y6 = ($Y1 / 18) * 13;
	$Y5 = ($Y1 / 18) * 14;
	$Y4 = ($Y1 / 18) * 15;
	$Y3 = ($Y1 / 18) * 16;
	$Y2 = ($Y1 / 18) * 17;

	$X1 = $x;
	$X2 = - $x;
	$X3 = $x;
	$X4 = - $x;
	$X5 = $x;
	$X6 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@$Y16){@$X6,@$Y17}{@$X6,@$Y18}(@0,@0), テンポ, 待ち);
}



//―――――――――――――――――――――――――――――――――――――――
.....//Ⅹ縮む
//―――――――――――――――――――――――――――――――――――――――


function FadeXWC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 6;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0), テンポ, 待ち);
}

function FadeXWC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 9;
	$X3 = ($X1 / 9) * 2;
	$X4 = ($X1 / 9) * 3;
	$X5 = ($X1 / 9) * 4;
	$X6 = ($X1 / 9) * 5;
	$X7 = ($X1 / 9) * 6;
	$X8 = ($X1 / 9) * 7;
	$X9 = ($X1 / 9) * 8;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X1,@0), テンポ, 待ち);
}

function FadeXWC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 12;
	$X3 = ($X1 / 12) * 2;
	$X4 = ($X1 / 12) * 3;
	$X5 = ($X1 / 12) * 4;
	$X6 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X8 = ($X1 / 12) * 7;
	$X9 = ($X1 / 12) * 8;
	$X10 = ($X1 / 12) * 9;
	$X11 = ($X1 / 12) * 10;
	$X12 = ($X1 / 12) * 11;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X1,@0), テンポ, 待ち);
}

function FadeXWC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 15;
	$X3 = ($X1 / 15) * 2;
	$X4 = ($X1 / 15) * 3;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 5;
	$X7 = ($X1 / 15) * 6;
	$X8 = ($X1 / 15) * 7;
	$X9 = ($X1 / 15) * 8;
	$X10 = ($X1 / 15) * 9;
	$X11 = ($X1 / 15) * 10;
	$X12 = ($X1 / 15) * 11;
	$X13 = ($X1 / 15) * 12;
	$X14 = ($X1 / 15) * 13;
	$X15 = ($X1 / 15) * 14;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;
	$Y5 = $Y1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@$X1,@0), テンポ, 待ち);
}

function FadeXWC6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 18;
	$X3 = ($X1 / 18) * 2;
	$X4 = ($X1 / 18) * 3;
	$X5 = ($X1 / 18) * 4;
	$X6 = ($X1 / 18) * 5;
	$X7 = ($X1 / 18) * 6;
	$X8 = ($X1 / 18) * 7;
	$X9 = ($X1 / 18) * 8;
	$X10 = ($X1 / 18) * 9;
	$X11 = ($X1 / 18) * 10;
	$X12 = ($X1 / 18) * 11;
	$X13 = ($X1 / 18) * 12;
	$X14 = ($X1 / 18) * 13;
	$X15 = ($X1 / 18) * 14;
	$X16 = ($X1 / 18) * 15;
	$X17 = ($X1 / 18) * 16;
	$X18 = ($X1 / 18) * 17;


	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;
	$Y5 = $Y1 / 5;
	$Y6 = - $Y1 / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@$X16,@0){@$X17,@$Y6}{@$X18,@$Y6}(@$X1,@0), テンポ, 待ち);
}

//=============================================================================//

function FadeXWWC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X6 = $X1 / 6;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadeXWWC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X9 = $X1 / 9;
	$X8 = ($X1 / 9) * 2;
	$X7 = ($X1 / 9) * 3;
	$X6 = ($X1 / 9) * 4;
	$X5 = ($X1 / 9) * 5;
	$X4 = ($X1 / 9) * 6;
	$X3 = ($X1 / 9) * 7;
	$X2 = ($X1 / 9) * 8;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadeXWWC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X12 = $X1 / 12;
	$X11 = ($X1 / 12) * 2;
	$X10 = ($X1 / 12) * 3;
	$X9 = ($X1 / 12) * 4;
	$X8 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X6 = ($X1 / 12) * 7;
	$X5 = ($X1 / 12) * 8;
	$X4 = ($X1 / 12) * 9;
	$X3 = ($X1 / 12) * 10;
	$X2 = ($X1 / 12) * 11;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadeXWWC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X15 = $X1 / 15;
	$X14 = ($X1 / 15) * 2;
	$X13 = ($X1 / 15) * 3;
	$X12 = ($X1 / 15) * 4;
	$X11 = ($X1 / 15) * 5;
	$X10 = ($X1 / 15) * 6;
	$X9 = ($X1 / 15) * 7;
	$X8 = ($X1 / 15) * 8;
	$X7 = ($X1 / 15) * 9;
	$X6 = ($X1 / 15) * 10;
	$X5 = ($X1 / 15) * 11;
	$X4 = ($X1 / 15) * 12;
	$X3 = ($X1 / 15) * 13;
	$X2 = ($X1 / 15) * 14;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;
	$Y5 = $Y1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadeXWWC6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X18 = $X1 / 18;
	$X17 = ($X1 / 18) * 2;
	$X16 = ($X1 / 18) * 3;
	$X15 = ($X1 / 18) * 4;
	$X14 = ($X1 / 18) * 5;
	$X13 = ($X1 / 18) * 6;
	$X12 = ($X1 / 18) * 7;
	$X11 = ($X1 / 18) * 8;
	$X10 = ($X1 / 18) * 9;
	$X9 = ($X1 / 18) * 10;
	$X8 = ($X1 / 18) * 11;
	$X7 = ($X1 / 18) * 12;
	$X6 = ($X1 / 18) * 13;
	$X5 = ($X1 / 18) * 14;
	$X4 = ($X1 / 18) * 15;
	$X3 = ($X1 / 18) * 16;
	$X2 = ($X1 / 18) * 17;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;
	$Y5 = $Y1 / 5;
	$Y6 = - $Y1 / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y4}{@$X12,@$Y4}(@$X13,@0){@$X14,@$Y5}{@$X15,@$Y5}(@$X16,@0){@$X17,@$Y6}{@$X18,@$Y6}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
.....//Ｙ縮む
//―――――――――――――――――――――――――――――――――――――――

function FadeYWC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 6;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 5;

	$X1 = $x;
	$X2 = - $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 9;
	$Y3 = ($Y1 / 9) * 2;
	$Y4 = ($Y1 / 9) * 3;
	$Y5 = ($Y1 / 9) * 4;
	$Y6 = ($Y1 / 9) * 5;
	$Y7 = ($Y1 / 9) * 6;
	$Y8 = ($Y1 / 9) * 7;
	$Y9 = ($Y1 / 9) * 8;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 12;
	$Y3 = ($Y1 / 12) * 2;
	$Y4 = ($Y1 / 12) * 3;
	$Y5 = ($Y1 / 12) * 4;
	$Y6 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y8 = ($Y1 / 12) * 7;
	$Y9 = ($Y1 / 12) * 8;
	$Y10 = ($Y1 / 12) * 9;
	$Y11 = ($Y1 / 12) * 10;
	$Y12 = ($Y1 / 12) * 11;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 15;
	$Y3 = ($Y1 / 15) * 2;
	$Y4 = ($Y1 / 15) * 3;
	$Y5 = ($Y1 / 15) * 4;
	$Y6 = ($Y1 / 15) * 5;
	$Y7 = ($Y1 / 15) * 6;
	$Y8 = ($Y1 / 15) * 7;
	$Y9 = ($Y1 / 15) * 8;
	$Y10 = ($Y1 / 15) * 9;
	$Y11 = ($Y1 / 15) * 10;
	$Y12 = ($Y1 / 15) * 11;
	$Y13 = ($Y1 / 15) * 12;
	$Y14 = ($Y1 / 15) * 13;
	$Y15 = ($Y1 / 15) * 14;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;
	$X5 = $X1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWC6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 18;
	$Y3 = ($Y1 / 18) * 2;
	$Y4 = ($Y1 / 18) * 3;
	$Y5 = ($Y1 / 18) * 4;
	$Y6 = ($Y1 / 18) * 5;
	$Y7 = ($Y1 / 18) * 6;
	$Y8 = ($Y1 / 18) * 7;
	$Y9 = ($Y1 / 18) * 8;
	$Y10 = ($Y1 / 18) * 9;
	$Y11 = ($Y1 / 18) * 10;
	$Y12 = ($Y1 / 18) * 11;
	$Y13 = ($Y1 / 18) * 12;
	$Y14 = ($Y1 / 18) * 13;
	$Y15 = ($Y1 / 18) * 14;
	$Y16 = ($Y1 / 18) * 15;
	$Y17 = ($Y1 / 18) * 16;
	$Y18 = ($Y1 / 18) * 17;


	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;
	$X5 = $X1 / 5;
	$X6 = - $X1 / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@$Y16){@$X6,@$Y17}{@$X6,@$Y18}(@0,@$Y1), テンポ, 待ち);
}

//=============================================================================//

function FadeYWWC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y6 = $Y1 / 6;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;
	$Y2 = ($Y1 / 6) * 5;

	$X1 = $x;
	$X2 = - $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadeYWWC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y9 = $Y1 / 9;
	$Y8 = ($Y1 / 9) * 2;
	$Y7 = ($Y1 / 9) * 3;
	$Y6 = ($Y1 / 9) * 4;
	$Y5 = ($Y1 / 9) * 5;
	$Y4 = ($Y1 / 9) * 6;
	$Y3 = ($Y1 / 9) * 7;
	$Y2 = ($Y1 / 9) * 8;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadeYWWC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y12 = $Y1 / 12;
	$Y11 = ($Y1 / 12) * 2;
	$Y10 = ($Y1 / 12) * 3;
	$Y9 = ($Y1 / 12) * 4;
	$Y8 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y6 = ($Y1 / 12) * 7;
	$Y5 = ($Y1 / 12) * 8;
	$Y4 = ($Y1 / 12) * 9;
	$Y3 = ($Y1 / 12) * 10;
	$Y2 = ($Y1 / 12) * 11;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@0), テンポ, 待ち);
}

function FadeYWWC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y15 = $Y1 / 15;
	$Y14 = ($Y1 / 15) * 2;
	$Y13 = ($Y1 / 15) * 3;
	$Y12 = ($Y1 / 15) * 4;
	$Y11 = ($Y1 / 15) * 5;
	$Y10 = ($Y1 / 15) * 6;
	$Y9 = ($Y1 / 15) * 7;
	$Y8 = ($Y1 / 15) * 8;
	$Y7 = ($Y1 / 15) * 9;
	$Y6 = ($Y1 / 15) * 10;
	$Y5 = ($Y1 / 15) * 11;
	$Y4 = ($Y1 / 15) * 12;
	$Y3 = ($Y1 / 15) * 13;
	$Y2 = ($Y1 / 15) * 14;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;
	$X5 = $X1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@0), テンポ, 待ち);
}

function FadeYWWC6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y18 = $Y1 / 18;
	$Y17 = ($Y1 / 18) * 2;
	$Y16 = ($Y1 / 18) * 3;
	$Y15 = ($Y1 / 18) * 4;
	$Y14 = ($Y1 / 18) * 5;
	$Y13 = ($Y1 / 18) * 6;
	$Y12 = ($Y1 / 18) * 7;
	$Y11 = ($Y1 / 18) * 8;
	$Y10 = ($Y1 / 18) * 9;
	$Y9 = ($Y1 / 18) * 10;
	$Y8 = ($Y1 / 18) * 11;
	$Y7 = ($Y1 / 18) * 12;
	$Y6 = ($Y1 / 18) * 13;
	$Y5 = ($Y1 / 18) * 14;
	$Y4 = ($Y1 / 18) * 15;
	$Y3 = ($Y1 / 18) * 16;
	$Y2 = ($Y1 / 18) * 17;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;
	$X5 = $X1 / 5;
	$X6 = - $X1 / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X4,@$Y11}{@$X4,@$Y12}(@0,@$Y13){@$X5,@$Y14}{@$X5,@$Y15}(@0,@$Y16){@$X6,@$Y17}{@$X6,@$Y18}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
.....//Ⅹ伸びる
//―――――――――――――――――――――――――――――――――――――――

function FadeXWE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 6;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXWE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 9;
	$X3 = ($X1 / 9) * 2;
	$X4 = ($X1 / 9) * 3;
	$X5 = ($X1 / 9) * 4;
	$X6 = ($X1 / 9) * 5;
	$X7 = ($X1 / 9) * 6;
	$X8 = ($X1 / 9) * 7;
	$X9 = ($X1 / 9) * 8;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y3}{@$X3,@$Y3}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXWE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 12;
	$X3 = ($X1 / 12) * 2;
	$X4 = ($X1 / 12) * 3;
	$X5 = ($X1 / 12) * 4;
	$X6 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X8 = ($X1 / 12) * 7;
	$X9 = ($X1 / 12) * 8;
	$X10 = ($X1 / 12) * 9;
	$X11 = ($X1 / 12) * 10;
	$X12 = ($X1 / 12) * 11;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y4}{@$X3,@$Y4}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y3}(@$X7,@0){@$X8,@$Y2}{@$X9,@$Y2}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXWE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 15;
	$X3 = ($X1 / 15) * 2;
	$X4 = ($X1 / 15) * 3;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 5;
	$X7 = ($X1 / 15) * 6;
	$X8 = ($X1 / 15) * 7;
	$X9 = ($X1 / 15) * 8;
	$X10 = ($X1 / 15) * 9;
	$X11 = ($X1 / 15) * 10;
	$X12 = ($X1 / 15) * 11;
	$X13 = ($X1 / 15) * 12;
	$X14 = ($X1 / 15) * 13;
	$X15 = ($X1 / 15) * 14;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;
	$Y5 = $Y1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y5}{@$X3,@$Y5}(@$X4,@0){@$X5,@$Y4}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y2}{@$X12,@$Y2}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXWE6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 18;
	$X3 = ($X1 / 18) * 2;
	$X4 = ($X1 / 18) * 3;
	$X5 = ($X1 / 18) * 4;
	$X6 = ($X1 / 18) * 5;
	$X7 = ($X1 / 18) * 6;
	$X8 = ($X1 / 18) * 7;
	$X9 = ($X1 / 18) * 8;
	$X10 = ($X1 / 18) * 9;
	$X11 = ($X1 / 18) * 10;
	$X12 = ($X1 / 18) * 11;
	$X13 = ($X1 / 18) * 12;
	$X14 = ($X1 / 18) * 13;
	$X15 = ($X1 / 18) * 14;
	$X16 = ($X1 / 18) * 15;
	$X17 = ($X1 / 18) * 16;
	$X18 = ($X1 / 18) * 17;


	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;
	$Y5 = $Y1 / 5;
	$Y6 = - $Y1 / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y6}{@$X3,@$Y6}(@$X4,@0){@$X5,@$Y5}{@$X6,@$Y5}(@$X7,@0){@$X8,@$Y4}{@$X9,@$Y4}(@$X10,@0){@$X11,@$Y3}{@$X12,@$Y3}(@$X13,@0){@$X14,@$Y2}{@$X15,@$Y2}(@$X16,@0){@$X17,@$Y1}{@$X18,@$Y1}(@$X1,@0), テンポ, 待ち);
}

//=============================================================================//

function FadeXWWE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X6 = $X1 / 6;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y2}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXWWE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X9 = $X1 / 9;
	$X8 = ($X1 / 9) * 2;
	$X7 = ($X1 / 9) * 3;
	$X6 = ($X1 / 9) * 4;
	$X5 = ($X1 / 9) * 5;
	$X4 = ($X1 / 9) * 6;
	$X3 = ($X1 / 9) * 7;
	$X2 = ($X1 / 9) * 8;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y3}{@$X3,@$Y3}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXWWE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X12 = $X1 / 12;
	$X11 = ($X1 / 12) * 2;
	$X10 = ($X1 / 12) * 3;
	$X9 = ($X1 / 12) * 4;
	$X8 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X6 = ($X1 / 12) * 7;
	$X5 = ($X1 / 12) * 8;
	$X4 = ($X1 / 12) * 9;
	$X3 = ($X1 / 12) * 10;
	$X2 = ($X1 / 12) * 11;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y4}{@$X3,@$Y4}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y3}(@$X7,@0){@$X8,@$Y2}{@$X9,@$Y2}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXWWE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X15 = $X1 / 15;
	$X14 = ($X1 / 15) * 2;
	$X13 = ($X1 / 15) * 3;
	$X12 = ($X1 / 15) * 4;
	$X11 = ($X1 / 15) * 5;
	$X10 = ($X1 / 15) * 6;
	$X9 = ($X1 / 15) * 7;
	$X8 = ($X1 / 15) * 8;
	$X7 = ($X1 / 15) * 9;
	$X6 = ($X1 / 15) * 10;
	$X5 = ($X1 / 15) * 11;
	$X4 = ($X1 / 15) * 12;
	$X3 = ($X1 / 15) * 13;
	$X2 = ($X1 / 15) * 14;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;
	$Y5 = $Y1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y5}{@$X3,@$Y5}(@$X4,@0){@$X5,@$Y4}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y2}{@$X12,@$Y2}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXWWE6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X18 = $X1 / 18;
	$X17 = ($X1 / 18) * 2;
	$X16 = ($X1 / 18) * 3;
	$X15 = ($X1 / 18) * 4;
	$X14 = ($X1 / 18) * 5;
	$X13 = ($X1 / 18) * 6;
	$X12 = ($X1 / 18) * 7;
	$X11 = ($X1 / 18) * 8;
	$X10 = ($X1 / 18) * 9;
	$X9 = ($X1 / 18) * 10;
	$X8 = ($X1 / 18) * 11;
	$X7 = ($X1 / 18) * 12;
	$X6 = ($X1 / 18) * 13;
	$X5 = ($X1 / 18) * 14;
	$X4 = ($X1 / 18) * 15;
	$X3 = ($X1 / 18) * 16;
	$X2 = ($X1 / 18) * 17;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;
	$Y3 = $Y1 / 3;
	$Y4 = - $Y1 / 4;
	$Y5 = $Y1 / 5;
	$Y6 = - $Y1 / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y6}{@$X3,@$Y6}(@$X4,@0){@$X5,@$Y5}{@$X6,@$Y5}(@$X7,@0){@$X8,@$Y4}{@$X9,@$Y4}(@$X10,@0){@$X11,@$Y3}{@$X12,@$Y3}(@$X13,@0){@$X14,@$Y2}{@$X15,@$Y2}(@$X16,@0){@$X17,@$Y1}{@$X18,@$Y1}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
.....//Ｙ伸びる
//―――――――――――――――――――――――――――――――――――――――

function FadeYWE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 6;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 5;

	$X1 = $x;
	$X2 = - $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X2,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 9;
	$Y3 = ($Y1 / 9) * 2;
	$Y4 = ($Y1 / 9) * 3;
	$Y5 = ($Y1 / 9) * 4;
	$Y6 = ($Y1 / 9) * 5;
	$Y7 = ($Y1 / 9) * 6;
	$Y8 = ($Y1 / 9) * 7;
	$Y9 = ($Y1 / 9) * 8;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X3,@$Y2}{@$X3,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 12;
	$Y3 = ($Y1 / 12) * 2;
	$Y4 = ($Y1 / 12) * 3;
	$Y5 = ($Y1 / 12) * 4;
	$Y6 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y8 = ($Y1 / 12) * 7;
	$Y9 = ($Y1 / 12) * 8;
	$Y10 = ($Y1 / 12) * 9;
	$Y11 = ($Y1 / 12) * 10;
	$Y12 = ($Y1 / 12) * 11;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X4,@$Y2}{@$X4,@$Y3}(@0,@$Y4){@$X3,@$Y5}{@$X3,@$Y6}(@0,@$Y7){@$X2,@$Y8}{@$X2,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 15;
	$Y3 = ($Y1 / 15) * 2;
	$Y4 = ($Y1 / 15) * 3;
	$Y5 = ($Y1 / 15) * 4;
	$Y6 = ($Y1 / 15) * 5;
	$Y7 = ($Y1 / 15) * 6;
	$Y8 = ($Y1 / 15) * 7;
	$Y9 = ($Y1 / 15) * 8;
	$Y10 = ($Y1 / 15) * 9;
	$Y11 = ($Y1 / 15) * 10;
	$Y12 = ($Y1 / 15) * 11;
	$Y13 = ($Y1 / 15) * 12;
	$Y14 = ($Y1 / 15) * 13;
	$Y15 = ($Y1 / 15) * 14;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;
	$X5 = $X1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X5,@$Y2}{@$X5,@$Y3}(@0,@$Y4){@$X4,@$Y5}{@$X4,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X2,@$Y11}{@$X2,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWE6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 18;
	$Y3 = ($Y1 / 18) * 2;
	$Y4 = ($Y1 / 18) * 3;
	$Y5 = ($Y1 / 18) * 4;
	$Y6 = ($Y1 / 18) * 5;
	$Y7 = ($Y1 / 18) * 6;
	$Y8 = ($Y1 / 18) * 7;
	$Y9 = ($Y1 / 18) * 8;
	$Y10 = ($Y1 / 18) * 9;
	$Y11 = ($Y1 / 18) * 10;
	$Y12 = ($Y1 / 18) * 11;
	$Y13 = ($Y1 / 18) * 12;
	$Y14 = ($Y1 / 18) * 13;
	$Y15 = ($Y1 / 18) * 14;
	$Y16 = ($Y1 / 18) * 15;
	$Y17 = ($Y1 / 18) * 16;
	$Y18 = ($Y1 / 18) * 17;


	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;
	$X5 = $X1 / 5;
	$X6 = - $X1 / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X6,@$Y2}{@$X6,@$Y3}(@0,@$Y4){@$X5,@$Y5}{@$X5,@$Y6}(@0,@$Y7){@$X4,@$Y8}{@$X4,@$Y9}(@0,@$Y10){@$X3,@$Y11}{@$X3,@$Y12}(@0,@$Y13){@$X2,@$Y14}{@$X2,@$Y15}(@0,@$Y16){@$X1,@$Y17}{@$X1,@$Y18}(@0,@$Y1), テンポ, 待ち);
}

//=============================================================================//

function FadeYWWE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y6 = $Y1 / 6;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;
	$Y2 = ($Y1 / 6) * 5;

	$X1 = $x;
	$X2 = - $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X2,@$Y2}{@$X2,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadeYWWE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y9 = $Y1 / 9;
	$Y8 = ($Y1 / 9) * 2;
	$Y7 = ($Y1 / 9) * 3;
	$Y6 = ($Y1 / 9) * 4;
	$Y5 = ($Y1 / 9) * 5;
	$Y4 = ($Y1 / 9) * 6;
	$Y3 = ($Y1 / 9) * 7;
	$Y2 = ($Y1 / 9) * 8;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X3,@$Y2}{@$X3,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadeYWWE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y12 = $Y1 / 12;
	$Y11 = ($Y1 / 12) * 2;
	$Y10 = ($Y1 / 12) * 3;
	$Y9 = ($Y1 / 12) * 4;
	$Y8 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y6 = ($Y1 / 12) * 7;
	$Y5 = ($Y1 / 12) * 8;
	$Y4 = ($Y1 / 12) * 9;
	$Y3 = ($Y1 / 12) * 10;
	$Y2 = ($Y1 / 12) * 11;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X4,@$Y2}{@$X4,@$Y3}(@0,@$Y4){@$X3,@$Y5}{@$X3,@$Y6}(@0,@$Y7){@$X2,@$Y8}{@$X2,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@0), テンポ, 待ち);
}

function FadeYWWE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y15 = $Y1 / 15;
	$Y14 = ($Y1 / 15) * 2;
	$Y13 = ($Y1 / 15) * 3;
	$Y12 = ($Y1 / 15) * 4;
	$Y11 = ($Y1 / 15) * 5;
	$Y10 = ($Y1 / 15) * 6;
	$Y9 = ($Y1 / 15) * 7;
	$Y8 = ($Y1 / 15) * 8;
	$Y7 = ($Y1 / 15) * 9;
	$Y6 = ($Y1 / 15) * 10;
	$Y5 = ($Y1 / 15) * 11;
	$Y4 = ($Y1 / 15) * 12;
	$Y3 = ($Y1 / 15) * 13;
	$Y2 = ($Y1 / 15) * 14;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;
	$X5 = $X1 / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X5,@$Y2}{@$X5,@$Y3}(@0,@$Y4){@$X4,@$Y5}{@$X4,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X2,@$Y11}{@$X2,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@0), テンポ, 待ち);
}

function FadeYWWE6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y18 = $Y1 / 18;
	$Y17 = ($Y1 / 18) * 2;
	$Y16 = ($Y1 / 18) * 3;
	$Y15 = ($Y1 / 18) * 4;
	$Y14 = ($Y1 / 18) * 5;
	$Y13 = ($Y1 / 18) * 6;
	$Y12 = ($Y1 / 18) * 7;
	$Y11 = ($Y1 / 18) * 8;
	$Y10 = ($Y1 / 18) * 9;
	$Y9 = ($Y1 / 18) * 10;
	$Y8 = ($Y1 / 18) * 11;
	$Y7 = ($Y1 / 18) * 12;
	$Y6 = ($Y1 / 18) * 13;
	$Y5 = ($Y1 / 18) * 14;
	$Y4 = ($Y1 / 18) * 15;
	$Y3 = ($Y1 / 18) * 16;
	$Y2 = ($Y1 / 18) * 17;

	$X1 = $x;
	$X2 = - $X1 / 2;
	$X3 = $X1 / 3;
	$X4 = - $X1 / 4;
	$X5 = $X1 / 5;
	$X6 = - $X1 / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X6,@$Y2}{@$X6,@$Y3}(@0,@$Y4){@$X5,@$Y5}{@$X5,@$Y6}(@0,@$Y7){@$X4,@$Y8}{@$X4,@$Y9}(@0,@$Y10){@$X3,@$Y11}{@$X3,@$Y12}(@0,@$Y13){@$X2,@$Y14}{@$X2,@$Y15}(@0,@$Y16){@$X1,@$Y17}{@$X1,@$Y18}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
.....//Ⅹランダム
//―――――――――――――――――――――――――――――――――――――――

function FadeXWR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 6;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 5;

	$Y1 = Random($y);
	$Y2 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXWR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 9;
	$X3 = ($X1 / 9) * 2;
	$X4 = ($X1 / 9) * 3;
	$X5 = ($X1 / 9) * 4;
	$X6 = ($X1 / 9) * 5;
	$X7 = ($X1 / 9) * 6;
	$X8 = ($X1 / 9) * 7;
	$X9 = ($X1 / 9) * 8;

	$Y1 = Random($y);
	$Y2 = - Random($y);
	$Y3 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y3}{@$X3,@$Y3}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXWR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 12;
	$X3 = ($X1 / 12) * 2;
	$X4 = ($X1 / 12) * 3;
	$X5 = ($X1 / 12) * 4;
	$X6 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X8 = ($X1 / 12) * 7;
	$X9 = ($X1 / 12) * 8;
	$X10 = ($X1 / 12) * 9;
	$X11 = ($X1 / 12) * 10;
	$X12 = ($X1 / 12) * 11;

	$Y1 = Random($y);
	$Y2 = - Random($y);
	$Y3 = Random($y);
	$Y4 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y4}{@$X3,@$Y4}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y3}(@$X7,@0){@$X8,@$Y2}{@$X9,@$Y2}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXWR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 15;
	$X3 = ($X1 / 15) * 2;
	$X4 = ($X1 / 15) * 3;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 5;
	$X7 = ($X1 / 15) * 6;
	$X8 = ($X1 / 15) * 7;
	$X9 = ($X1 / 15) * 8;
	$X10 = ($X1 / 15) * 9;
	$X11 = ($X1 / 15) * 10;
	$X12 = ($X1 / 15) * 11;
	$X13 = ($X1 / 15) * 12;
	$X14 = ($X1 / 15) * 13;
	$X15 = ($X1 / 15) * 14;

	$Y1 = Random($y);
	$Y2 = - Random($y);
	$Y3 = Random($y);
	$Y4 = - Random($y);
	$Y5 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y5}{@$X3,@$Y5}(@$X4,@0){@$X5,@$Y4}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y2}{@$X12,@$Y2}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@$X1,@0), テンポ, 待ち);
}

function FadeXWR6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = $X1 / 18;
	$X3 = ($X1 / 18) * 2;
	$X4 = ($X1 / 18) * 3;
	$X5 = ($X1 / 18) * 4;
	$X6 = ($X1 / 18) * 5;
	$X7 = ($X1 / 18) * 6;
	$X8 = ($X1 / 18) * 7;
	$X9 = ($X1 / 18) * 8;
	$X10 = ($X1 / 18) * 9;
	$X11 = ($X1 / 18) * 10;
	$X12 = ($X1 / 18) * 11;
	$X13 = ($X1 / 18) * 12;
	$X14 = ($X1 / 18) * 13;
	$X15 = ($X1 / 18) * 14;
	$X16 = ($X1 / 18) * 15;
	$X17 = ($X1 / 18) * 16;
	$X18 = ($X1 / 18) * 17;


	$Y1 = Random($y);
	$Y2 = - Random($y);
	$Y3 = Random($y);
	$Y4 = - Random($y);
	$Y5 = Random($y);
	$Y6 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y6}{@$X3,@$Y6}(@$X4,@0){@$X5,@$Y5}{@$X6,@$Y5}(@$X7,@0){@$X8,@$Y4}{@$X9,@$Y4}(@$X10,@0){@$X11,@$Y3}{@$X12,@$Y3}(@$X13,@0){@$X14,@$Y2}{@$X15,@$Y2}(@$X16,@0){@$X17,@$Y1}{@$X18,@$Y1}(@$X1,@0), テンポ, 待ち);
}

//=============================================================================//

function FadeXWWR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X6 = $X1 / 6;
	$X5 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X3 = ($X1 / 6) * 4;
	$X2 = ($X1 / 6) * 5;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y2}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y1}{@$X6,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXWWR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X9 = $X1 / 9;
	$X8 = ($X1 / 9) * 2;
	$X7 = ($X1 / 9) * 3;
	$X6 = ($X1 / 9) * 4;
	$X5 = ($X1 / 9) * 5;
	$X4 = ($X1 / 9) * 6;
	$X3 = ($X1 / 9) * 7;
	$X2 = ($X1 / 9) * 8;

	$Y1 = Random($y);
	$Y2 = - Random($y);
	$Y3 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y3}{@$X3,@$Y3}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X7,@0){@$X8,@$Y1}{@$X9,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXWWR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X12 = $X1 / 12;
	$X11 = ($X1 / 12) * 2;
	$X10 = ($X1 / 12) * 3;
	$X9 = ($X1 / 12) * 4;
	$X8 = ($X1 / 12) * 5;
	$X7 = ($X1 / 12) * 6;
	$X6 = ($X1 / 12) * 7;
	$X5 = ($X1 / 12) * 8;
	$X4 = ($X1 / 12) * 9;
	$X3 = ($X1 / 12) * 10;
	$X2 = ($X1 / 12) * 11;

	$Y1 = Random($y);
	$Y2 = - Random($y);
	$Y3 = Random($y);
	$Y4 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y4}{@$X3,@$Y4}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y3}(@$X7,@0){@$X8,@$Y2}{@$X9,@$Y2}(@$X10,@0){@$X11,@$Y1}{@$X12,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXWWR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X15 = $X1 / 15;
	$X14 = ($X1 / 15) * 2;
	$X13 = ($X1 / 15) * 3;
	$X12 = ($X1 / 15) * 4;
	$X11 = ($X1 / 15) * 5;
	$X10 = ($X1 / 15) * 6;
	$X9 = ($X1 / 15) * 7;
	$X8 = ($X1 / 15) * 8;
	$X7 = ($X1 / 15) * 9;
	$X6 = ($X1 / 15) * 10;
	$X5 = ($X1 / 15) * 11;
	$X4 = ($X1 / 15) * 12;
	$X3 = ($X1 / 15) * 13;
	$X2 = ($X1 / 15) * 14;

	$Y1 = Random($y);
	$Y2 = - Random($y);
	$Y3 = Random($y);
	$Y4 = - Random($y);
	$Y5 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y5}{@$X3,@$Y5}(@$X4,@0){@$X5,@$Y4}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y3}{@$X9,@$Y3}(@$X10,@0){@$X11,@$Y2}{@$X12,@$Y2}(@$X13,@0){@$X14,@$Y1}{@$X15,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeXWWR6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X18 = $X1 / 18;
	$X17 = ($X1 / 18) * 2;
	$X16 = ($X1 / 18) * 3;
	$X15 = ($X1 / 18) * 4;
	$X14 = ($X1 / 18) * 5;
	$X13 = ($X1 / 18) * 6;
	$X12 = ($X1 / 18) * 7;
	$X11 = ($X1 / 18) * 8;
	$X10 = ($X1 / 18) * 9;
	$X9 = ($X1 / 18) * 10;
	$X8 = ($X1 / 18) * 11;
	$X7 = ($X1 / 18) * 12;
	$X6 = ($X1 / 18) * 13;
	$X5 = ($X1 / 18) * 14;
	$X4 = ($X1 / 18) * 15;
	$X3 = ($X1 / 18) * 16;
	$X2 = ($X1 / 18) * 17;

	$Y1 = Random($y);
	$Y2 = - Random($y);
	$Y3 = Random($y);
	$Y4 = - Random($y);
	$Y5 = Random($y);
	$Y6 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y6}{@$X3,@$Y6}(@$X4,@0){@$X5,@$Y5}{@$X6,@$Y5}(@$X7,@0){@$X8,@$Y4}{@$X9,@$Y4}(@$X10,@0){@$X11,@$Y3}{@$X12,@$Y3}(@$X13,@0){@$X14,@$Y2}{@$X15,@$Y2}(@$X16,@0){@$X17,@$Y1}{@$X18,@$Y1}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
.....//Ｙランダム
//―――――――――――――――――――――――――――――――――――――――

function FadeYWR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 6;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 5;

	$X1 = $x;
	$X2 = - $X1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X2,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 9;
	$Y3 = ($Y1 / 9) * 2;
	$Y4 = ($Y1 / 9) * 3;
	$Y5 = ($Y1 / 9) * 4;
	$Y6 = ($Y1 / 9) * 5;
	$Y7 = ($Y1 / 9) * 6;
	$Y8 = ($Y1 / 9) * 7;
	$Y9 = ($Y1 / 9) * 8;

	$X1 = Random($x);
	$X2 = - Random($x);
	$X3 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X3,@$Y2}{@$X3,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 12;
	$Y3 = ($Y1 / 12) * 2;
	$Y4 = ($Y1 / 12) * 3;
	$Y5 = ($Y1 / 12) * 4;
	$Y6 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y8 = ($Y1 / 12) * 7;
	$Y9 = ($Y1 / 12) * 8;
	$Y10 = ($Y1 / 12) * 9;
	$Y11 = ($Y1 / 12) * 10;
	$Y12 = ($Y1 / 12) * 11;

	$X1 = Random($x);
	$X2 = - Random($x);
	$X3 = Random($x);
	$X4 = - Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X4,@$Y2}{@$X4,@$Y3}(@0,@$Y4){@$X3,@$Y5}{@$X3,@$Y6}(@0,@$Y7){@$X2,@$Y8}{@$X2,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 15;
	$Y3 = ($Y1 / 15) * 2;
	$Y4 = ($Y1 / 15) * 3;
	$Y5 = ($Y1 / 15) * 4;
	$Y6 = ($Y1 / 15) * 5;
	$Y7 = ($Y1 / 15) * 6;
	$Y8 = ($Y1 / 15) * 7;
	$Y9 = ($Y1 / 15) * 8;
	$Y10 = ($Y1 / 15) * 9;
	$Y11 = ($Y1 / 15) * 10;
	$Y12 = ($Y1 / 15) * 11;
	$Y13 = ($Y1 / 15) * 12;
	$Y14 = ($Y1 / 15) * 13;
	$Y15 = ($Y1 / 15) * 14;

	$X1 = Random($x);
	$X2 = - Random($x);
	$X3 = Random($x);
	$X4 = - Random($x);
	$X5 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X5,@$Y2}{@$X5,@$Y3}(@0,@$Y4){@$X4,@$Y5}{@$X4,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X2,@$Y11}{@$X2,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@$Y1), テンポ, 待ち);
}

function FadeYWR6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = $Y1 / 18;
	$Y3 = ($Y1 / 18) * 2;
	$Y4 = ($Y1 / 18) * 3;
	$Y5 = ($Y1 / 18) * 4;
	$Y6 = ($Y1 / 18) * 5;
	$Y7 = ($Y1 / 18) * 6;
	$Y8 = ($Y1 / 18) * 7;
	$Y9 = ($Y1 / 18) * 8;
	$Y10 = ($Y1 / 18) * 9;
	$Y11 = ($Y1 / 18) * 10;
	$Y12 = ($Y1 / 18) * 11;
	$Y13 = ($Y1 / 18) * 12;
	$Y14 = ($Y1 / 18) * 13;
	$Y15 = ($Y1 / 18) * 14;
	$Y16 = ($Y1 / 18) * 15;
	$Y17 = ($Y1 / 18) * 16;
	$Y18 = ($Y1 / 18) * 17;


	$X1 = Random($x);
	$X2 = - Random($x);
	$X3 = Random($x);
	$X4 = - Random($x);
	$X5 = Random($x);
	$X6 = - Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X6,@$Y2}{@$X6,@$Y3}(@0,@$Y4){@$X5,@$Y5}{@$X5,@$Y6}(@0,@$Y7){@$X4,@$Y8}{@$X4,@$Y9}(@0,@$Y10){@$X3,@$Y11}{@$X3,@$Y12}(@0,@$Y13){@$X2,@$Y14}{@$X2,@$Y15}(@0,@$Y16){@$X1,@$Y17}{@$X1,@$Y18}(@0,@$Y1), テンポ, 待ち);
}

//=============================================================================//

function FadeYWWR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y6 = $Y1 / 6;
	$Y5 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y3 = ($Y1 / 6) * 4;
	$Y2 = ($Y1 / 6) * 5;

	$X1 = Random($x);
	$X2 = - Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X2,@$Y2}{@$X2,@$Y3}(@0,@$Y4){@$X1,@$Y5}{@$X1,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadeYWWR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y9 = $Y1 / 9;
	$Y8 = ($Y1 / 9) * 2;
	$Y7 = ($Y1 / 9) * 3;
	$Y6 = ($Y1 / 9) * 4;
	$Y5 = ($Y1 / 9) * 5;
	$Y4 = ($Y1 / 9) * 6;
	$Y3 = ($Y1 / 9) * 7;
	$Y2 = ($Y1 / 9) * 8;

	$X1 = Random($x);
	$X2 = - Random($x);
	$X3 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X3,@$Y2}{@$X3,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y7){@$X1,@$Y8}{@$X1,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadeYWWR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y12 = $Y1 / 12;
	$Y11 = ($Y1 / 12) * 2;
	$Y10 = ($Y1 / 12) * 3;
	$Y9 = ($Y1 / 12) * 4;
	$Y8 = ($Y1 / 12) * 5;
	$Y7 = ($Y1 / 12) * 6;
	$Y6 = ($Y1 / 12) * 7;
	$Y5 = ($Y1 / 12) * 8;
	$Y4 = ($Y1 / 12) * 9;
	$Y3 = ($Y1 / 12) * 10;
	$Y2 = ($Y1 / 12) * 11;

	$X1 = Random($x);
	$X2 = - Random($x);
	$X3 = Random($x);
	$X4 = - Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X4,@$Y2}{@$X4,@$Y3}(@0,@$Y4){@$X3,@$Y5}{@$X3,@$Y6}(@0,@$Y7){@$X2,@$Y8}{@$X2,@$Y9}(@0,@$Y10){@$X1,@$Y11}{@$X1,@$Y12}(@0,@0), テンポ, 待ち);
}

function FadeYWWR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y15 = $Y1 / 15;
	$Y14 = ($Y1 / 15) * 2;
	$Y13 = ($Y1 / 15) * 3;
	$Y12 = ($Y1 / 15) * 4;
	$Y11 = ($Y1 / 15) * 5;
	$Y10 = ($Y1 / 15) * 6;
	$Y9 = ($Y1 / 15) * 7;
	$Y8 = ($Y1 / 15) * 8;
	$Y7 = ($Y1 / 15) * 9;
	$Y6 = ($Y1 / 15) * 10;
	$Y5 = ($Y1 / 15) * 11;
	$Y4 = ($Y1 / 15) * 12;
	$Y3 = ($Y1 / 15) * 13;
	$Y2 = ($Y1 / 15) * 14;

	$X1 = Random($x);
	$X2 = - Random($x);
	$X3 = Random($x);
	$X4 = - Random($x);
	$X5 = Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X5,@$Y2}{@$X5,@$Y3}(@0,@$Y4){@$X4,@$Y5}{@$X4,@$Y6}(@0,@$Y7){@$X3,@$Y8}{@$X3,@$Y9}(@0,@$Y10){@$X2,@$Y11}{@$X2,@$Y12}(@0,@$Y13){@$X1,@$Y14}{@$X1,@$Y15}(@0,@0), テンポ, 待ち);
}

function FadeYWWR6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = - $y;
	$Y18 = $Y1 / 18;
	$Y17 = ($Y1 / 18) * 2;
	$Y16 = ($Y1 / 18) * 3;
	$Y15 = ($Y1 / 18) * 4;
	$Y14 = ($Y1 / 18) * 5;
	$Y13 = ($Y1 / 18) * 6;
	$Y12 = ($Y1 / 18) * 7;
	$Y11 = ($Y1 / 18) * 8;
	$Y10 = ($Y1 / 18) * 9;
	$Y9 = ($Y1 / 18) * 10;
	$Y8 = ($Y1 / 18) * 11;
	$Y7 = ($Y1 / 18) * 12;
	$Y6 = ($Y1 / 18) * 13;
	$Y5 = ($Y1 / 18) * 14;
	$Y4 = ($Y1 / 18) * 15;
	$Y3 = ($Y1 / 18) * 16;
	$Y2 = ($Y1 / 18) * 17;

	$X1 = Random($x);
	$X2 = - Random($x);
	$X3 = Random($x);
	$X4 = - Random($x);
	$X5 = Random($x);
	$X6 = - Random($x);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@$Y1){@$X6,@$Y2}{@$X6,@$Y3}(@0,@$Y4){@$X5,@$Y5}{@$X5,@$Y6}(@0,@$Y7){@$X4,@$Y8}{@$X4,@$Y9}(@0,@$Y10){@$X3,@$Y11}{@$X3,@$Y12}(@0,@$Y13){@$X2,@$Y14}{@$X2,@$Y15}(@0,@$Y16){@$X1,@$Y17}{@$X1,@$Y18}(@0,@0), テンポ, 待ち);
}

//――――――――――――――――――――――――――――――――――――――//
....//オーバー曲線移動
//――――――――――――――――――――――――――――――――――――――//

function FadeXO("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = - ($X1 / 10) * 2;
	$Y2 = ($Y1 / 10) * 1;

	$X3 = ($X1 / 10) * 4;
	$Y3 = ($Y1 / 10) * 9;


	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X1,@$Y1), テンポ, 待ち);
}

function FadeXOO("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = - $y;

	$X2 = ($X1 / 10) * 12;
	$Y2 = ($Y1 / 10) * 9;

	$X3 = ($X1 / 10) * 6;
	$Y3 = ($Y1 / 10) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadeYO("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 10) * 6;
	$Y2 = ($Y1 / 10) * 1;

	$X3 = ($X1 / 10) * 12;
	$Y3 = ($Y1 / 10) * 9;


	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X1,@$Y1), テンポ, 待ち);
}

function FadeYOO("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = - $y;

	$X2 = ($X1 / 10) * 4;
	$Y2 = ($Y1 / 10) * 9;

	$X3 = - ($X1 / 10) * 2;
	$Y3 = ($Y1 / 10) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

//――――――――――――――――――――――――――――――――――――――//
....//直線移動
//――――――――――――――――――――――――――――――――――――――//

function FadeL("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	$X2 = ($X1 / 3) * 2;
	$Y2 = ($Y1 / 3) * 2;

	$X3 = ($X1 / 3) * 1;
	$Y3 = ($Y1 / 3) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X3,@$Y3}{@$X2,@$Y2}(@$X1,@$Y1), テンポ, 待ち);
}

function FadeLL("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$Y1 = - $y;

	$X2 = ($X1 / 3) * 2;
	$Y2 = ($Y1 / 3) * 2;

	$X3 = ($X1 / 3) * 1;
	$Y3 = ($Y1 / 3) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
....//ステップ
//―――――――――――――――――――――――――――――――――――――――

function FadeS("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 15) * 2;
	$X3 = ($X1 / 15) * 4
	$X4 = ($X1 / 15) * 6;
	$X5 = ($X1 / 10) * 6;
	$X6 = ($X1 / 10) * 8;

	$Y1 = $y;
	$Y2 = ($Y1 / 10) * 1;
	$Y3 = ($Y1 / 10) * 2;
	$Y4 = ($Y1 / 10) * 6;
	$Y5 = ($Y1 / 10) * 3;


	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y1){@$X5,@$Y4}{@$X6,@$Y5}(@$X1,@0), テンポ, 待ち);
}

function FadeSS("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X2 = ($X1 / 15) * 13;
	$X3 = ($X1 / 15) * 11
	$X4 = ($X1 / 15) * 9;
	$X5 = ($X1 / 10) * 4;
	$X6 = ($X1 / 10) * 2;

	$Y1 = $y;
	$Y2 = ($Y1 / 10) * 1;
	$Y3 = ($Y1 / 10) * 2;
	$Y4 = ($Y1 / 10) * 6;
	$Y5 = ($Y1 / 10) * 3;


	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y1){@$X5,@$Y4}{@$X6,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadeK("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 10) * 2;
	$X3 = ($X1 / 10) * 4;
	$X4 = ($X1 / 10) * 6;
	$X5 = ($X1 / 15) * 11;
	$X6 = ($X1 / 15) * 13;

	$Y1 = $y;
	$Y2 = ($Y1 / 10) * 3;
	$Y3 = ($Y1 / 10) * 6;
	$Y4 = ($Y1 / 10) * 2;
	$Y5 = ($Y1 / 10) * 1;


	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y1){@$X5,@$Y4}{@$X6,@$Y5}(@$X1,@0), テンポ, 待ち);
}

function FadeKK("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X2 = ($X1 / 10) * 8;
	$X3 = ($X1 / 10) * 6
	$X4 = ($X1 / 10) * 4;
	$X5 = ($X1 / 15) * 4;
	$X6 = ($X1 / 15) * 2;

	$Y1 = $y;
	$Y2 = ($Y1 / 10) * 3;
	$Y3 = ($Y1 / 10) * 6;
	$Y4 = ($Y1 / 10) * 2;
	$Y5 = ($Y1 / 10) * 1;


	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y1){@$X5,@$Y4}{@$X6,@$Y5}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
....//上下左右反復
//―――――――――――――――――――――――――――――――――――――――
//―――――――――――――――――――――――――――――――――――――――
.....//上下左右反復移動
//―――――――――――――――――――――――――――――――――――――――

function FadeQ("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ7("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ8("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ9("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQ10("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
.....//上下左右反復縮む
//―――――――――――――――――――――――――――――――――――――――

function FadeQC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadeQC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadeQC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = $x / 4;
	$Y4 = $y / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadeQC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = $x / 4;
	$Y4 = $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadeQC6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = $x / 4;
	$Y4 = $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = $x / 6;
	$Y6 = $y / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadeQC7("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = $x / 4;
	$Y4 = $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = $x / 6;
	$Y6 = $y / 6;
	$X7 = $x / 7;
	$Y7 = $y / 7;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0), テンポ, 待ち);
}

function FadeQC8("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = $x / 4;
	$Y4 = $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = $x / 6;
	$Y6 = $y / 6;
	$X7 = $x / 7;
	$Y7 = $y / 7;
	$X8 = $x / 8;
	$Y8 = $y / 8;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0), テンポ, 待ち);
}

function FadeQC9("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = $x / 4;
	$Y4 = $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = $x / 6;
	$Y6 = $y / 6;
	$X7 = $x / 7;
	$Y7 = $y / 7;
	$X8 = $x / 8;
	$Y8 = $y / 8;
	$X9 = $x / 9;
	$Y9 = $y / 9;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadeQC10("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = $x / 4;
	$Y4 = $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = $x / 6;
	$Y6 = $y / 6;
	$X7 = $x / 7;
	$Y7 = $y / 7;
	$X8 = $x / 8;
	$Y8 = $y / 8;
	$X9 = $x / 9;
	$Y9 = $y / 9;
	$X10 = $x / 10;
	$Y10 = $y / 10;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0){@$X10,@$Y10}{@$X10,@$Y10}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
.....//上下左右反復運動伸びる
//―――――――――――――――――――――――――――――――――――――――

function FadeQE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X2 = $x;
	$Y2 = $y;
	$X1 = $x / 2;
	$Y1 = $y / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadeQE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X3 = $x;
	$Y3 = $y;
	$X2 = $x / 2;
	$Y2 = $y / 2;
	$X1 = $x / 3;
	$Y1 = $y / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadeQE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X4 = $x;
	$Y4 = $y;
	$X3 = $x / 2;
	$Y3 = $y / 2;
	$X2 = $x / 3;
	$Y2 = $y / 3;
	$X1 = $x / 4;
	$Y1 = $y / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadeQE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X5 = $x;
	$Y5 = $y;
	$X4 = $x / 2;
	$Y4 = $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X2 = $x / 4;
	$Y2 = $y / 4;
	$X1 = $x / 5;
	$Y1 = $y / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadeQE6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X6 = $x;
	$Y6 = $y;
	$X5 = $x / 2;
	$Y5 = $y / 2;
	$X4 = $x / 3;
	$Y4 = $y / 3;
	$X3 = $x / 4;
	$Y3 = $y / 4;
	$X2 = $x / 5;
	$Y2 = $y / 5;
	$X1 = $x / 6;
	$Y1 = $y / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadeQE7("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X7 = $x;
	$Y7 = $y;
	$X6 = $x / 2;
	$Y6 = $y / 2;
	$X5 = $x / 3;
	$Y5 = $y / 3;
	$X4 = $x / 4;
	$Y4 = $y / 4;
	$X3 = $x / 5;
	$Y3 = $y / 5;
	$X2 = $x / 6;
	$Y2 = $y / 6;
	$X1 = $x / 7;
	$Y1 = $y / 7;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0), テンポ, 待ち);
}

function FadeQE8("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X8 = $x;
	$Y8 = $y;
	$X7 = $x / 2;
	$Y7 = $y / 2;
	$X6 = $x / 3;
	$Y6 = $y / 3;
	$X5 = $x / 4;
	$Y5 = $y / 4;
	$X4 = $x / 5;
	$Y4 = $y / 5;
	$X3 = $x / 6;
	$Y3 = $y / 6;
	$X2 = $x / 7;
	$Y2 = $y / 7;
	$X1 = $x / 8;
	$Y1 = $y / 8;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0), テンポ, 待ち);
}

function FadeQE9("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X9 = $x;
	$Y9 = $y;
	$X8 = $x / 2;
	$Y8 = $y / 2;
	$X7 = $x / 3;
	$Y7 = $y / 3;
	$X6 = $x / 4;
	$Y6 = $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X4 = $x / 6;
	$Y4 = $y / 6;
	$X3 = $x / 7;
	$Y3 = $y / 7;
	$X2 = $x / 8;
	$Y2 = $y / 8;
	$X1 = $x / 9;
	$Y1 = $y / 9;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadeQE10("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X10 = $x;
	$Y10 = $y;
	$X9 = $x / 2;
	$Y9 = $y / 2;
	$X8 = $x / 3;
	$Y8 = $y / 3;
	$X7 = $x / 4;
	$Y7 = $y / 4;
	$X6 = $x / 5;
	$Y6 = $y / 5;
	$X5 = $x / 6;
	$Y5 = $y / 6;
	$X4 = $x / 7;
	$Y4 = $y / 7;
	$X3 = $x / 8;
	$Y3 = $y / 8;
	$X2 = $x / 9;
	$Y2 = $y / 9;
	$X1 = $x / 10;
	$Y1 = $y / 10;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0){@$X10,@$Y10}{@$X10,@$Y10}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
.....//上下左右反復移動ランダム
//―――――――――――――――――――――――――――――――――――――――

function FadeQR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQR6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQR7("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQR8("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQR9("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}

function FadeQR10("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
....//上下左右均等
//―――――――――――――――――――――――――――――――――――――――
//―――――――――――――――――――――――――――――――――――――――
.....//上下左右均等移動
//―――――――――――――――――――――――――――――――――――――――

function FadeP2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadeP3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;
	$X3 = $x;
	$Y3 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadeP4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;
	$X3 = $x;
	$Y3 = $y;
	$X4 = - $x;
	$Y4 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadeP5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;
	$X3 = $x;
	$Y3 = $y;
	$X4 = - $x;
	$Y4 = - $y;
	$X5 = $x;
	$Y5 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadeP6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;
	$X3 = $x;
	$Y3 = $y;
	$X4 = - $x;
	$Y4 = - $y;
	$X5 = $x;
	$Y5 = $y;
	$X6 = - $x;
	$Y6 = - $y;


	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadeP7("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;
	$X3 = $x;
	$Y3 = $y;
	$X4 = - $x;
	$Y4 = - $y;
	$X5 = $x;
	$Y5 = $y;
	$X6 = - $x;
	$Y6 = - $y;
	$X7 = $x;
	$Y7 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0), テンポ, 待ち);
}

function FadeP8("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;
	$X3 = $x;
	$Y3 = $y;
	$X4 = - $x;
	$Y4 = - $y;
	$X5 = $x;
	$Y5 = $y;
	$X6 = - $x;
	$Y6 = - $y;
	$X7 = $x;
	$Y7 = $y;
	$X8 = - $x;
	$Y8 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0), テンポ, 待ち);
}

function FadeP9("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;
	$X3 = $x;
	$Y3 = $y;
	$X4 = - $x;
	$Y4 = - $y;
	$X5 = $x;
	$Y5 = $y;
	$X6 = - $x;
	$Y6 = - $y;
	$X7 = $x;
	$Y7 = $y;
	$X8 = - $x;
	$Y8 = - $y;
	$X9 = $x;
	$Y9 = $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadeP10("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x;
	$Y2 = - $y;
	$X3 = $x;
	$Y3 = $y;
	$X4 = - $x;
	$Y4 = - $y;
	$X5 = $x;
	$Y5 = $y;
	$X6 = - $x;
	$Y6 = - $y;
	$X7 = $x;
	$Y7 = $y;
	$X8 = - $x;
	$Y8 = - $y;
	$X9 = $x;
	$Y9 = $y;
	$X10 = - $x;
	$Y10 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0){@$X10,@$Y10}{@$X10,@$Y10}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
.....//上下左右均等縮む曲線
//―――――――――――――――――――――――――――――――――――――――

function FadePC2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;


	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadePC3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadePC4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = - $x / 4;
	$Y4 = - $y / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadePC5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = - $x / 4;
	$Y4 = - $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadePC6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = - $x / 4;
	$Y4 = - $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = - $x / 6;
	$Y6 = - $y / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadePC7("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = - $x / 4;
	$Y4 = - $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = - $x / 6;
	$Y6 = - $y / 6;
	$X7 = $x / 7;
	$Y7 = $y / 7;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0), テンポ, 待ち);
}

function FadePC8("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = - $x / 4;
	$Y4 = - $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = - $x / 6;
	$Y6 = - $y / 6;
	$X7 = $x / 7;
	$Y7 = $y / 7;
	$X8 = - $x / 8;
	$Y8 = - $y / 8;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0), テンポ, 待ち);
}

function FadePC9("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = - $x / 4;
	$Y4 = - $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = - $x / 6;
	$Y6 = - $y / 6;
	$X7 = $x / 7;
	$Y7 = $y / 7;
	$X8 = - $x / 8;
	$Y8 = - $y / 8;
	$X9 = $x / 9;
	$Y9 = $y / 9;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadePC10("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$Y1 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X4 = - $x / 4;
	$Y4 = - $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X6 = - $x / 6;
	$Y6 = - $y / 6;
	$X7 = $x / 7;
	$Y7 = $y / 7;
	$X8 = - $x / 8;
	$Y8 = - $y / 8;
	$X9 = $x / 9;
	$Y9 = $y / 9;
	$X10 = - $x / 10;
	$Y10 = - $y / 10;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0){@$X10,@$Y10}{@$X10,@$Y10}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
.....//上下左右均等伸びる曲線
//―――――――――――――――――――――――――――――――――――――――

function FadePE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X2 = $x;
	$Y2 = $y;
	$X1 = - $x / 2;
	$Y1 = - $y / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadePE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X3 = $x;
	$Y3 = $y;
	$X2 = - $x / 2;
	$Y2 = - $y / 2;
	$X1 = $x / 3;
	$Y1 = $y / 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadePE4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X4 = $x;
	$Y4 = $y;
	$X3 = - $x / 2;
	$Y3 = - $y / 2;
	$X2 = $x / 3;
	$Y2 = $y / 3;
	$X1 = - $x / 4;
	$Y1 = - $y / 4;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadePE5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X5 = $x;
	$Y5 = $y;
	$X4 = - $x / 2;
	$Y4 = - $y / 2;
	$X3 = $x / 3;
	$Y3 = $y / 3;
	$X2 = - $x / 4;
	$Y2 = - $y / 4;
	$X1 = $x / 5;
	$Y1 = $y / 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadePE6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X6 = $x;
	$Y6 = $y;
	$X5 = - $x / 2;
	$Y5 = - $y / 2;
	$X4 = $x / 3;
	$Y4 = $y / 3;
	$X3 = - $x / 4;
	$Y3 = - $y / 4;
	$X2 = $x / 5;
	$Y2 = $y / 5;
	$X1 = - $x / 6;
	$Y1 = - $y / 6;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadePE7("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X7 = $x;
	$Y7 = $y;
	$X6 = - $x / 2;
	$Y6 = - $y / 2;
	$X5 = $x / 3;
	$Y5 = $y / 3;
	$X4 = - $x / 4;
	$Y4 = - $y / 4;
	$X3 = $x / 5;
	$Y3 = $y / 5;
	$X2 = - $x / 6;
	$Y2 = - $y / 6;
	$X1 = $x / 7;
	$Y1 = $y / 7;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0), テンポ, 待ち);
}

function FadePE8("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X8 = $x;
	$Y8 = $y;
	$X7 = - $x / 2;
	$Y7 = - $y / 2;
	$X6 = $x / 3;
	$Y6 = $y / 3;
	$X5 = - $x / 4;
	$Y5 = - $y / 4;
	$X4 = $x / 5;
	$Y4 = $y / 5;
	$X3 = - $x / 6;
	$Y3 = - $y / 6;
	$X2 = $x / 7;
	$Y2 = $y / 7;
	$X1 = - $x / 8;
	$Y1 = - $y / 8;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0), テンポ, 待ち);
}

function FadePE9("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X9 = $x;
	$Y9 = $y;
	$X8 = - $x / 2;
	$Y8 = - $y / 2;
	$X7 = $x / 3;
	$Y7 = $y / 3;
	$X6 = - $x / 4;
	$Y6 = - $y / 4;
	$X5 = $x / 5;
	$Y5 = $y / 5;
	$X4 = - $x / 6;
	$Y4 = - $y / 6;
	$X3 = $x / 7;
	$Y3 = $y / 7;
	$X2 = - $x / 8;
	$Y2 = - $y / 8;
	$X1 = $x / 9;
	$Y1 = $y / 9;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadePE10("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X10 = $x;
	$Y10 = $y;
	$X9 = - $x / 2;
	$Y9 = - $y / 2;
	$X8 = $x / 3;
	$Y8 = $y / 3;
	$X7 = - $x / 4;
	$Y7 = - $y / 4;
	$X6 = $x / 5;
	$Y6 = $y / 5;
	$X5 = - $x / 6;
	$Y5 = - $y / 6;
	$X4 = $x / 7;
	$Y4 = $y / 7;
	$X3 = - $x / 8;
	$Y3 = - $y / 8;
	$X2 = $x / 9;
	$Y2 = $y / 9;
	$X1 = - $x / 10;
	$Y1 = - $y / 10;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0){@$X10,@$Y10}{@$X10,@$Y10}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
.....//上下左右均等移動ランダム
//―――――――――――――――――――――――――――――――――――――――

function FadePR2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x);
	$Y2 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadePR3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x);
	$Y2 = - Random($y);
	$X3 = Random($x);
	$Y3 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0), テンポ, 待ち);
}

function FadePR4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x);
	$Y2 = - Random($y);
	$X3 = Random($x);
	$Y3 = Random($y);
	$X4 = - Random($x);
	$Y4 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadePR5("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x);
	$Y2 = - Random($x);
	$X3 = Random($x);
	$Y3 = Random($y);
	$X4 = - Random($x);
	$Y4 = - Random($y);
	$X5 = Random($x);
	$Y5 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0), テンポ, 待ち);
}

function FadePR6("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x);
	$Y2 = - Random($x);
	$X3 = Random($x);
	$Y3 = Random($y);
	$X4 = - Random($x);
	$Y4 = - Random($y);
	$X5 = Random($x);
	$Y5 = Random($y);
	$X6 = - Random($x);
	$Y6 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0), テンポ, 待ち);
}

function FadePR7("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x);
	$Y2 = - Random($x);
	$X3 = Random($x);
	$Y3 = Random($y);
	$X4 = - Random($x);
	$Y4 = - Random($y);
	$X5 = Random($x);
	$Y5 = Random($y);
	$X6 = - Random($x);
	$Y6 = - Random($y);
	$X7 = Random($x);
	$Y7 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0), テンポ, 待ち);
}

function FadePR8("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x);
	$Y2 = - Random($x);
	$X3 = Random($x);
	$Y3 = Random($y);
	$X4 = - Random($x);
	$Y4 = - Random($y);
	$X5 = Random($x);
	$Y5 = Random($y);
	$X6 = - Random($x);
	$Y6 = - Random($y);
	$X7 = Random($x);
	$Y7 = Random($y);
	$X8 = - Random($x);
	$Y8 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0), テンポ, 待ち);
}

function FadePR9("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x)
	$Y2 = - Random($x);
	$X3 = Random($x);
	$Y3 = Random($y);
	$X4 = - Random($x);
	$Y4 = - Random($y);
	$X5 = Random($x);
	$Y5 = Random($y);
	$X6 = - Random($x);
	$Y6 = - Random($y);
	$X7 = Random($x);
	$Y7 = Random($y);
	$X8 = - Random($x);
	$Y8 = - Random($y);
	$X9 = Random($x);
	$Y9 = Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0), テンポ, 待ち);
}

function FadePR10("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = Random($x);
	$Y1 = Random($y);
	$X2 = - Random($x)
	$Y2 = - Random($x);
	$X3 = Random($x);
	$Y3 = Random($y);
	$X4 = - Random($x);
	$Y4 = - Random($y);
	$X5 = Random($x);
	$Y5 = Random($y);
	$X6 = - Random($x);
	$Y6 = - Random($y);
	$X7 = Random($x);
	$Y7 = Random($y);
	$X8 = - Random($x);
	$Y8 = - Random($y);
	$X9 = Random($x);
	$Y9 = Random($y);
	$X10 = - Random($x);
	$Y10 = - Random($y);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X1,@$Y1}(@0,@0){@$X2,@$Y2}{@$X2,@$Y2}(@0,@0){@$X3,@$Y3}{@$X3,@$Y3}(@0,@0){@$X4,@$Y4}{@$X4,@$Y4}(@0,@0){@$X5,@$Y5}{@$X5,@$Y5}(@0,@0){@$X6,@$Y6}{@$X6,@$Y6}(@0,@0){@$X7,@$Y7}{@$X7,@$Y7}(@0,@0){@$X8,@$Y8}{@$X8,@$Y8}(@0,@0){@$X9,@$Y9}{@$X9,@$Y9}(@0,@0){@$X10,@$Y10}{@$X10,@$Y10}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
....//震え
//―――――――――――――――――――――――――――――――――――――――
//―――――――――――――――――――――――――――――――――――――――
.....//震えランダム
//―――――――――――――――――――――――――――――――――――――――

function FadeFR("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 9) * 1 + Random($z);
	$X3 = ($X1 / 9) * 2 - Random($z);
	$X4 = ($X1 / 9) * 3 - Random($z);
	$X5 = ($X1 / 9) * 4 + Random($z);
	$X6 = ($X1 / 9) * 5 - Random($z);
	$X7 = ($X1 / 9) * 6 - Random($z);
	$X8 = ($X1 / 9) * 7 - Random($z);
	$X9 = ($X1 / 9) * 8 + Random($z);

	$Y1 = $y;
	$Y2 = ($Y1 / 9) * 1 - Random($z);
	$Y3 = ($Y1 / 9) * 2 + Random($z);
	$Y4 = ($Y1 / 9) * 3 - Random($z);
	$Y5 = ($Y1 / 9) * 4 - Random($z);
	$Y6 = ($Y1 / 9) * 5 + Random($z);
	$Y7 = ($Y1 / 9) * 6 + Random($z);
	$Y8 = ($Y1 / 9) * 7 + Random($z);
	$Y9 = ($Y1 / 9) * 8 - Random($z);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X1,@$Y1), テンポ, 待ち);

}

function FadeFR2("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = $x;
	$X11 = ($X1 / 9) * 1 + Random($z);
	$X12 = ($X1 / 9) * 2 + Random($z);
	$X13 = ($X1 / 9) * 3 + Random($z);
	$X14 = ($X1 / 9) * 4 - Random($z);
	$X15 = ($X1 / 9) * 5 + Random($z);
	$X16 = ($X1 / 9) * 6 + Random($z);
	$X17 = ($X1 / 9) * 7 - Random($z);
	$X18 = ($X1 / 9) * 8 + Random($z);

	$Y1 = $y;
	$Y11 = ($Y1 / 9) * 1 - Random($z);
	$Y12 = ($Y1 / 9) * 2 - Random($z);
	$Y13 = ($Y1 / 9) * 3 - Random($z);
	$Y14 = ($Y1 / 9) * 4 + Random($z);
	$Y15 = ($Y1 / 9) * 5 + Random($z);
	$Y16 = ($Y1 / 9) * 6 - Random($z);
	$Y17 = ($Y1 / 9) * 7 + Random($z);
	$Y18 = ($Y1 / 9) * 8 + Random($z);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@$X1,@$Y1), テンポ, 待ち);

}

function FadeFR3("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 18) * 1 + Random($z);
	$X3 = ($X1 / 18) * 2 - Random($z);
	$X4 = ($X1 / 18) * 3 - Random($z);
	$X5 = ($X1 / 18) * 4 + Random($z);
	$X6 = ($X1 / 18) * 5 - Random($z);
	$X7 = ($X1 / 18) * 6 - Random($z);
	$X8 = ($X1 / 18) * 7 - Random($z);
	$X9 = ($X1 / 18) * 8 + Random($z);
	$X10 = ($X1 / 18) * 9 + Random($z);
	$X11 = ($X1 / 18) * 10 + Random($z);
	$X12 = ($X1 / 18) * 11 - Random($z);
	$X13 = ($X1 / 18) * 12 + Random($z);
	$X14 = ($X1 / 18) * 13 - Random($z);
	$X15 = ($X1 / 18) * 14 + Random($z);
	$X16 = ($X1 / 18) * 15 + Random($z);
	$X17 = ($X1 / 18) * 16 - Random($z);
	$X18 = ($X1 / 18) * 17 + Random($z);

	$Y1 = $y;
	$Y2 = ($Y1 / 18) * 1 - Random($z);
	$Y3 = ($Y1 / 18) * 2 + Random($z);
	$Y4 = ($Y1 / 18) * 3 - Random($z);
	$Y5 = ($Y1 / 18) * 4 - Random($z);
	$Y6 = ($Y1 / 18) * 5 + Random($z);
	$Y7 = ($Y1 / 18) * 6 + Random($z);
	$Y8 = ($Y1 / 18) * 7 + Random($z);
	$Y9 = ($Y1 / 18) * 8 - Random($z);
	$Y10 = ($Y1 / 18) * 9 + Random($z);
	$Y11 = ($Y1 / 18) * 10 - Random($z);
	$Y12 = ($Y1 / 18) * 11 - Random($z);
	$Y13 = ($Y1 / 18) * 12 - Random($z);
	$Y14 = ($Y1 / 18) * 13 + Random($z);
	$Y15 = ($Y1 / 18) * 14 + Random($z);
	$Y16 = ($Y1 / 18) * 15 + Random($z);
	$Y17 = ($Y1 / 18) * 16 + Random($z);
	$Y18 = ($Y1 / 18) * 17 + Random($z);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X10,@$Y10){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@$X1,@$Y1), テンポ, 待ち);

}

function FadeFR4("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{

	$X1 = $x;
	$X2 = ($X1 / 36) * 1 + Random($z);
	$X3 = ($X1 / 36) * 2 - Random($z);
	$X4 = ($X1 / 36) * 3 - Random($z);
	$X5 = ($X1 / 36) * 4 + Random($z);
	$X6 = ($X1 / 36) * 5 - Random($z);
	$X7 = ($X1 / 36) * 6;
	$X8 = ($X1 / 36) * 7 - Random($z);
	$X9 = ($X1 / 36) * 8 + Random($z);
	$X10 = ($X1 / 36) * 9 + Random($z);
	$X11 = ($X1 / 36) * 10 + Random($z);
	$X12 = ($X1 / 36) * 11 + Random($z);
	$X13 = ($X1 / 36) * 12;
	$X14 = ($X1 / 36) * 13 + Random($z);
	$X15 = ($X1 / 36) * 14 + Random($z);
	$X16 = ($X1 / 36) * 15 + Random($z);
	$X17 = ($X1 / 36) * 16 - Random($z);
	$X18 = ($X1 / 36) * 17 + Random($z);
	$X19 = ($X1 / 36) * 18;
	$X20 = ($X1 / 36) * 19 + Random($z);
	$X21 = ($X1 / 36) * 20 - Random($z);
	$X22 = ($X1 / 36) * 21 - Random($z);
	$X23 = ($X1 / 36) * 22 + Random($z);
	$X24 = ($X1 / 36) * 23 - Random($z);
	$X25 = ($X1 / 36) * 24;
	$X26 = ($X1 / 36) * 25 - Random($z);
	$X27 = ($X1 / 36) * 26 + Random($z);
	$X28 = ($X1 / 36) * 27 + Random($z);
	$X29 = ($X1 / 36) * 28 + Random($z);
	$X30 = ($X1 / 36) * 29 + Random($z);
	$X31 = ($X1 / 36) * 30;
	$X32 = ($X1 / 36) * 31 + Random($z);
	$X33 = ($X1 / 36) * 32 + Random($z);
	$X34 = ($X1 / 36) * 33 + Random($z);
	$X35 = ($X1 / 36) * 34 - Random($z);
	$X36 = ($X1 / 36) * 35 + Random($z);


	$Y1 = $y;
	$Y2 = ($Y1 / 36) * 1 - Random($z);
	$Y3 = ($Y1 / 36) * 2 + Random($z);
	$Y4 = ($Y1 / 36) * 3 - Random($z);
	$Y5 = ($Y1 / 36) * 4 - Random($z);
	$Y6 = ($Y1 / 36) * 5 + Random($z);
	$Y7 = ($Y1 / 36) * 6 + Random($z);
	$Y8 = ($Y1 / 36) * 7 + Random($z);
	$Y9 = ($Y1 / 36) * 8 - Random($z);
	$Y10 = ($Y1 / 36) * 9 + Random($z);
	$Y11 = ($Y1 / 36) * 10 - Random($z);
	$Y12 = ($Y1 / 36) * 11 - Random($z);
	$Y13 = ($Y1 / 36) * 12 + Random($z);
	$Y14 = ($Y1 / 36) * 13 + Random($z);
	$Y15 = ($Y1 / 36) * 14 + Random($z);
	$Y16 = ($Y1 / 36) * 15 + Random($z);
	$Y17 = ($Y1 / 36) * 16 + Random($z);
	$Y18 = ($Y1 / 36) * 17 + Random($z);
	$Y19 = ($Y1 / 36) * 18 + Random($z);
	$Y20 = ($Y1 / 36) * 19 - Random($z);
	$Y21 = ($Y1 / 36) * 20 + Random($z);
	$Y22 = ($Y1 / 36) * 21 - Random($z);
	$Y23 = ($Y1 / 36) * 22 - Random($z);
	$Y24 = ($Y1 / 36) * 23 + Random($z);
	$Y25 = ($Y1 / 36) * 24 + Random($z);
	$Y26 = ($Y1 / 36) * 25 + Random($z);
	$Y27 = ($Y1 / 36) * 26 - Random($z);
	$Y28 = ($Y1 / 36) * 27 + Random($z);
	$Y29 = ($Y1 / 36) * 28 - Random($z);
	$Y30 = ($Y1 / 36) * 29 - Random($z);
	$Y31 = ($Y1 / 36) * 30 - Random($z);
	$Y32 = ($Y1 / 36) * 31 + Random($z);
	$Y33 = ($Y1 / 36) * 32 + Random($z);
	$Y34 = ($Y1 / 36) * 33 + Random($z);
	$Y35 = ($Y1 / 36) * 34 + Random($z);
	$Y36 = ($Y1 / 36) * 35 + Random($z);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X10,@$Y10){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@$X19,@$Y19){@$X20,@$Y20}{@$X21,@$Y21}(@$X22,@$Y22){@$X23,@$Y23}{@$X24,@$Y24}(@$X25,@$Y25){@$X26,@$Y26}{@$X27,@$Y27}(@$X28,@$Y28){@$X29,@$Y29}{@$X30,@$Y30}(@$X31,@$Y31){@$X32,@$Y32}{@$X33,@$Y33}(@$X34,@$Y34){@$X35,@$Y35}{@$X36,@$Y36}(@$X1,@$Y1), テンポ, 待ち);

}


//=============================================================================//


function FadeFFR("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = - $x;
	$X9 = ($X1 / 9) * 1 + Random($z);
	$X8 = ($X1 / 9) * 2 - Random($z);
	$X7 = ($X1 / 9) * 3 - Random($z);
	$X6 = ($X1 / 9) * 4 + Random($z);
	$X5 = ($X1 / 9) * 5 - Random($z);
	$X4 = ($X1 / 9) * 6 - Random($z);
	$X3 = ($X1 / 9) * 7 - Random($z);
	$X2 = ($X1 / 9) * 8 + Random($z);

	$Y1 = - $y;
	$Y9 = ($Y1 / 9) * 1 - Random($z);
	$Y8 = ($Y1 / 9) * 2 + Random($z);
	$Y7 = ($Y1 / 9) * 3 - Random($z);
	$Y6 = ($Y1 / 9) * 4 - Random($z);
	$Y5 = ($Y1 / 9) * 5 + Random($z);
	$Y4 = ($Y1 / 9) * 6 + Random($z);
	$Y3 = ($Y1 / 9) * 7 + Random($z);
	$Y2 = ($Y1 / 9) * 8 - Random($z);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@0,@0), テンポ, 待ち);

}

function FadeFFR2("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = - $x;
	$X18 = ($X1 / 9) * 1 + Random($z);
	$X17 = ($X1 / 9) * 2 + Random($z);
	$X16 = ($X1 / 9) * 3 - Random($z);
	$X15 = ($X1 / 9) * 4 + Random($z);
	$X14 = ($X1 / 9) * 5 + Random($z);
	$X13 = ($X1 / 9) * 6 + Random($z);
	$X12 = ($X1 / 9) * 7 - Random($z);
	$X11 = ($X1 / 9) * 8 + Random($z);

	$Y1 = - $y;
	$Y18 = ($Y1 / 9) * 1 - Random($z);
	$Y17 = ($Y1 / 9) * 2 - Random($z);
	$Y16 = ($Y1 / 9) * 3 - Random($z);
	$Y15 = ($Y1 / 9) * 4 + Random($z);
	$Y14 = ($Y1 / 9) * 5 + Random($z);
	$Y13 = ($Y1 / 9) * 6 - Random($z);
	$Y12 = ($Y1 / 9) * 7 + Random($z);
	$Y11 = ($Y1 / 9) * 8 + Random($z);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@0,@0), テンポ, 待ち);

}

function FadeFFR3("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = - $x;
	$X18 = ($X1 / 18) * 1 + Random($z);
	$X17 = ($X1 / 18) * 2 - Random($z);
	$X16 = ($X1 / 18) * 3 - Random($z);
	$X15 = ($X1 / 18) * 4 + Random($z);
	$X14 = ($X1 / 18) * 5 - Random($z);
	$X13 = ($X1 / 18) * 6 - Random($z);
	$X12 = ($X1 / 18) * 7 - Random($z);
	$X11 = ($X1 / 18) * 8 + Random($z);
	$X10 = ($X1 / 18) * 9 + Random($z);
	$X9 = ($X1 / 18) * 10 + Random($z);
	$X8 = ($X1 / 18) * 11 + Random($z);
	$X7 = ($X1 / 18) * 12 + Random($z);
	$X6 = ($X1 / 18) * 13 + Random($z);
	$X5 = ($X1 / 18) * 14 + Random($z);
	$X4 = ($X1 / 18) * 15 + Random($z);
	$X3 = ($X1 / 18) * 16 - Random($z);
	$X2 = ($X1 / 18) * 17 + Random($z);

	$Y1 = - $y;
	$Y18 = ($Y1 / 18) * 1 - Random($z);
	$Y17 = ($Y1 / 18) * 2 + Random($z);
	$Y16 = ($Y1 / 18) * 3 - Random($z);
	$Y15 = ($Y1 / 18) * 4 - Random($z);
	$Y14 = ($Y1 / 18) * 5 + Random($z);
	$Y13 = ($Y1 / 18) * 6 + Random($z);
	$Y12 = ($Y1 / 18) * 7 + Random($z);
	$Y11 = ($Y1 / 18) * 8 - Random($z);
	$Y10 = ($Y1 / 18) * 9 + Random($z);
	$Y9 = ($Y1 / 18) * 10 - Random($z);
	$Y8 = ($Y1 / 18) * 11 - Random($z);
	$Y7 = ($Y1 / 18) * 12 - Random($z);
	$Y6 = ($Y1 / 18) * 13 + Random($z);
	$Y5 = ($Y1 / 18) * 14 + Random($z);
	$Y4 = ($Y1 / 18) * 15 - Random($z);
	$Y3 = ($Y1 / 18) * 16 + Random($z);
	$Y2 = ($Y1 / 18) * 17 + Random($z);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X10,@$Y10){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@0,@0), テンポ, 待ち);

}

function FadeFFR4("ナット名",描画時間,透過度,t,$x,$y,$z,テンポ, 待ち)
{
	$X1 = - $x;
	$X36 = ($X1 / 36) * 1 + Random($z);
	$X35 = ($X1 / 36) * 2 - Random($z);
	$X34 = ($X1 / 36) * 3 - Random($z);
	$X33 = ($X1 / 36) * 4 + Random($z);
	$X32 = ($X1 / 36) * 5 - Random($z);
	$X31 = ($X1 / 36) * 6 - Random($z);
	$X30 = ($X1 / 36) * 7 - Random($z);
	$X29 = ($X1 / 36) * 8 + Random($z);
	$X28 = ($X1 / 36) * 9 + Random($z);
	$X27 = ($X1 / 36) * 10 + Random($z);
	$X26 = ($X1 / 36) * 11 - Random($z);
	$X25 = ($X1 / 36) * 12 + Random($z);
	$X24 = ($X1 / 36) * 13 + Random($z);
	$X23 = ($X1 / 36) * 14 + Random($z);
	$X22 = ($X1 / 36) * 15 + Random($z);
	$X21 = ($X1 / 36) * 16 - Random($z);
	$X20 = ($X1 / 36) * 17 + Random($z);
	$X19 = ($X1 / 36) * 18 + Random($z);
	$X18 = ($X1 / 36) * 19 + Random($z);
	$X17 = ($X1 / 36) * 20 - Random($z);
	$X16 = ($X1 / 36) * 21 - Random($z);
	$X15 = ($X1 / 36) * 22 + Random($z);
	$X14 = ($X1 / 36) * 23 - Random($z);
	$X13 = ($X1 / 36) * 24 - Random($z);
	$X12 = ($X1 / 36) * 25 - Random($z);
	$X11 = ($X1 / 36) * 26 + Random($z);
	$X10 = ($X1 / 36) * 27 + Random($z);
	$X9 = ($X1 / 36) * 28 + Random($z);
	$X8 = ($X1 / 36) * 29 + Random($z);
	$X7 = ($X1 / 36) * 30 - Random($z);
	$X6 = ($X1 / 36) * 31 + Random($z);
	$X5 = ($X1 / 36) * 32 + Random($z);
	$X4 = ($X1 / 36) * 33 + Random($z);
	$X3 = ($X1 / 36) * 34 - Random($z);
	$X2 = ($X1 / 36) * 35 + Random($z);


	$Y1 = - $y;
	$Y36 = ($Y1 / 36) * 1 - Random($z);
	$Y35 = ($Y1 / 36) * 2 + Random($z);
	$Y34 = ($Y1 / 36) * 3 - Random($z);
	$Y33 = ($Y1 / 36) * 4 - Random($z);
	$Y32 = ($Y1 / 36) * 5 + Random($z);
	$Y31 = ($Y1 / 36) * 6 + Random($z);
	$Y30 = ($Y1 / 36) * 7 + Random($z);
	$Y29 = ($Y1 / 36) * 8 - Random($z);
	$Y28 = ($Y1 / 36) * 9 + Random($z);
	$Y27 = ($Y1 / 36) * 10 - Random($z);
	$Y26 = ($Y1 / 36) * 11 - Random($z);
	$Y25 = ($Y1 / 36) * 12 - Random($z);
	$Y24 = ($Y1 / 36) * 13 + Random($z);
	$Y23 = ($Y1 / 36) * 14 + Random($z);
	$Y22 = ($Y1 / 36) * 15 + Random($z);
	$Y21 = ($Y1 / 36) * 16 - Random($z);
	$Y20 = ($Y1 / 36) * 17 + Random($z);
	$Y19 = ($Y1 / 36) * 18 + Random($z);
	$Y18 = ($Y1 / 36) * 19 - Random($z);
	$Y17 = ($Y1 / 36) * 20 + Random($z);
	$Y16 = ($Y1 / 36) * 21 - Random($z);
	$Y15 = ($Y1 / 36) * 22 - Random($z);
	$Y14 = ($Y1 / 36) * 23 + Random($z);
	$Y13 = ($Y1 / 36) * 24 + Random($z);
	$Y12 = ($Y1 / 36) * 25 + Random($z);
	$Y11 = ($Y1 / 36) * 26 - Random($z);
	$Y10 = ($Y1 / 36) * 27 + Random($z);
	$Y9 = ($Y1 / 36) * 28 - Random($z);
	$Y8 = ($Y1 / 36) * 29 - Random($z);
	$Y7 = ($Y1 / 36) * 30 - Random($z);
	$Y6 = ($Y1 / 36) * 31 + Random($z);
	$Y5 = ($Y1 / 36) * 32 + Random($z);
	$Y4 = ($Y1 / 36) * 33 + Random($z);
	$Y3 = ($Y1 / 36) * 34 - Random($z);
	$Y2 = ($Y1 / 36) * 35 + Random($z);

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X10,@$Y10){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@$X19,@$Y19){@$X20,@$Y20}{@$X21,@$Y21}(@$X22,@$Y22){@$X23,@$Y23}{@$X24,@$Y24}(@$X25,@$Y25){@$X26,@$Y26}{@$X27,@$Y27}(@$X28,@$Y28){@$X29,@$Y29}{@$X30,@$Y30}(@$X31,@$Y31){@$X32,@$Y32}{@$X33,@$Y33}(@$X34,@$Y34){@$X35,@$Y35}{@$X36,@$Y36}(@0,@0), テンポ, 待ち);

}


//―――――――――――――――――――――――――――――――――――――――
.....//震えマスター
//―――――――――――――――――――――――――――――――――――――――

function FadeF("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 9) + 5;
	$X3 = ($X1 / 9) * 2 + - 10;
	$X4 = ($X1 / 9) * 3 + - 10;
	$X5 = ($X1 / 9) * 4 + 5;
	$X6 = ($X1 / 9) * 5 + - 10;
	$X7 = ($X1 / 9) * 6 + - 10;
	$X8 = ($X1 / 9) * 7 + - 10;
	$X9 = ($X1 / 9) * 8 + 5;

	$Y1 = $y;
	$Y2 = ($Y1 / 9) + - 10;
	$Y3 = ($Y1 / 9) * 2 + 10;
	$Y4 = ($Y1 / 9) * 3 + -5;
	$Y5 = ($Y1 / 9) * 4 + -10;
	$Y6 = ($Y1 / 9) * 5 + 5;
	$Y7 = ($Y1 / 9) * 6 + 0;
	$Y8 = ($Y1 / 9) * 7 + 10;
	$Y9 = ($Y1 / 9) * 8 + -10;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X1,@$Y1), テンポ, 待ち);

}

function FadeF2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X11 = ($X1 / 9) + 5;
	$X12 = ($X1 / 9) * 2 + 10;
	$X13 = ($X1 / 9) * 3 + 15;
	$X14 = ($X1 / 9) * 4 + 10;
	$X15 = ($X1 / 9) * 5 + 5;
	$X16 = ($X1 / 9) * 6 + 0;
	$X17 = ($X1 / 9) * 7 + - 5;
	$X18 = ($X1 / 9) * 8 + 5;

	$Y1 = $y;
	$Y11 = ($Y1 / 9) + -15;
	$Y12 = ($Y1 / 9) * 2 + -10;
	$Y13 = ($Y1 / 9) * 3 + -5;
	$Y14 = ($Y1 / 9) * 4 + 0;
	$Y15 = ($Y1 / 9) * 5 + 5;
	$Y16 = ($Y1 / 9) * 6 + 10;
	$Y17 = ($Y1 / 9) * 7 + 15;
	$Y18 = ($Y1 / 9) * 8 + 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@$X1,@$Y1), テンポ, 待ち);

}

function FadeF3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 18) + 5;
	$X3 = ($X1 / 18) * 2 + - 10;
	$X4 = ($X1 / 18) * 3 + - 10;
	$X5 = ($X1 / 18) * 4 + 5;
	$X6 = ($X1 / 18) * 5 + - 10;
	$X7 = ($X1 / 18) * 6 + - 10;
	$X8 = ($X1 / 18) * 7 + - 10;
	$X9 = ($X1 / 18) * 8 + 5;
	$X10 = ($X1 / 18) * 9 + 0;
	$X11 = ($X1 / 18) * 10 + 5;
	$X12 = ($X1 / 18) * 11 + 10;
	$X13 = ($X1 / 18) * 12 + 15;
	$X14 = ($X1 / 18) * 13 + 10;
	$X15 = ($X1 / 18) * 14 + 5;
	$X16 = ($X1 / 18) * 15 + 0;
	$X17 = ($X1 / 18) * 16 + - 5;
	$X18 = ($X1 / 18) * 17 + 5;

	$Y1 = $y;
	$Y2 = ($Y1 / 18) + - 10;
	$Y3 = ($Y1 / 18) * 2 + 10;
	$Y4 = ($Y1 / 18) * 3 + -5;
	$Y5 = ($Y1 / 18) * 4 + -10;
	$Y6 = ($Y1 / 18) * 5 + 5;
	$Y7 = ($Y1 / 18) * 6 + 0;
	$Y8 = ($Y1 / 18) * 7 + 10;
	$Y9 = ($Y1 / 18) * 8 + -10;
	$Y10 = ($Y1 / 18) * 9 + 0;
	$Y11 = ($Y1 / 18) * 10 + -15;
	$Y12 = ($Y1 / 18) * 11 + -10;
	$Y13 = ($Y1 / 18) * 12 + -5;
	$Y14 = ($Y1 / 18) * 13 + 0;
	$Y15 = ($Y1 / 18) * 14 + 5;
	$Y16 = ($Y1 / 18) * 15 + 10;
	$Y17 = ($Y1 / 18) * 16 + 15;
	$Y18 = ($Y1 / 18) * 17 + 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X10,@$Y10){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@$X1,@$Y1), テンポ, 待ち);

}

function FadeF4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 36) * 1 + 5;
	$X3 = ($X1 / 36) * 2 + - 10;
	$X4 = ($X1 / 36) * 3 + - 10;
	$X5 = ($X1 / 36) * 4 + 5;
	$X6 = ($X1 / 36) * 5 + - 10;
	$X7 = ($X1 / 36) * 6 + - 10;
	$X8 = ($X1 / 36) * 7 + - 10;
	$X9 = ($X1 / 36) * 8 + 5;
	$X10 = ($X1 / 36) * 9 + 0;
	$X11 = ($X1 / 36) * 10 + 5;
	$X12 = ($X1 / 36) * 11 + 10;
	$X13 = ($X1 / 36) * 12 + 15;
	$X14 = ($X1 / 36) * 13 + 10;
	$X15 = ($X1 / 36) * 14 + 5;
	$X16 = ($X1 / 36) * 15 + 0;
	$X17 = ($X1 / 36) * 16 + - 5;
	$X18 = ($X1 / 36) * 17 + 5;
	$X19 = ($X1 / 36) * 18;
	$X20 = ($X1 / 36) * 19 + 5;
	$X21 = ($X1 / 36) * 20 + - 10;
	$X22 = ($X1 / 36) * 21 + - 10;
	$X23 = ($X1 / 36) * 22 + 5;
	$X24 = ($X1 / 36) * 23 + - 10;
	$X25 = ($X1 / 36) * 24 + - 10;
	$X26 = ($X1 / 36) * 25 + - 10;
	$X27 = ($X1 / 36) * 26 + 5;
	$X28 = ($X1 / 36) * 27 + 0;
	$X29 = ($X1 / 36) * 28 + 5;
	$X30 = ($X1 / 36) * 29 + 10;
	$X31 = ($X1 / 36) * 30 + 15;
	$X32 = ($X1 / 36) * 31 + 10;
	$X33 = ($X1 / 36) * 32 + 5;
	$X34 = ($X1 / 36) * 33 + 0;
	$X35 = ($X1 / 36) * 34 + - 5;
	$X36 = ($X1 / 36) * 35 + 5;


	$Y1 = $y;
	$Y2 = ($Y1 / 36) * 1 + - 10;
	$Y3 = ($Y1 / 36) * 2 + 10;
	$Y4 = ($Y1 / 36) * 3 + -5;
	$Y5 = ($Y1 / 36) * 4 + -10;
	$Y6 = ($Y1 / 36) * 5 + 5;
	$Y7 = ($Y1 / 36) * 6 + 0;
	$Y8 = ($Y1 / 36) * 7 + 10;
	$Y9 = ($Y1 / 36) * 8 + -10;
	$Y10 = ($Y1 / 36) * 9 + 0;
	$Y11 = ($Y1 / 36) * 10 + -15;
	$Y12 = ($Y1 / 36) * 11 + -10;
	$Y13 = ($Y1 / 36) * 12 + -5;
	$Y14 = ($Y1 / 36) * 13 + 0;
	$Y15 = ($Y1 / 36) * 14 + 5;
	$Y16 = ($Y1 / 36) * 15 + 10;
	$Y17 = ($Y1 / 36) * 16 + 15;
	$Y18 = ($Y1 / 36) * 17 + 5;
	$Y19 = ($Y1 / 36) * 18;
	$Y20 = ($Y1 / 36) * 19 + - 10;
	$Y21 = ($Y1 / 36) * 20 + 10;
	$Y22 = ($Y1 / 36) * 21 + -5;
	$Y23 = ($Y1 / 36) * 22 + -10;
	$Y24 = ($Y1 / 36) * 23 + 5;
	$Y25 = ($Y1 / 36) * 24 + 0;
	$Y26 = ($Y1 / 36) * 25 + 10;
	$Y27 = ($Y1 / 36) * 26 + -10;
	$Y28 = ($Y1 / 36) * 27 + 0;
	$Y29 = ($Y1 / 36) * 28 + -15;
	$Y30 = ($Y1 / 36) * 29 + -10;
	$Y31 = ($Y1 / 36) * 30 + -5;
	$Y32 = ($Y1 / 36) * 31 + 0;
	$Y33 = ($Y1 / 36) * 32 + 5;
	$Y34 = ($Y1 / 36) * 33 + 10;
	$Y35 = ($Y1 / 36) * 34 + 15;
	$Y36 = ($Y1 / 36) * 35 + 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X10,@$Y10){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@$X19,@$Y19){@$X20,@$Y20}{@$X21,@$Y21}(@$X22,@$Y22){@$X23,@$Y23}{@$X24,@$Y24}(@$X25,@$Y25){@$X26,@$Y26}{@$X27,@$Y27}(@$X28,@$Y28){@$X29,@$Y29}{@$X30,@$Y30}(@$X31,@$Y31){@$X32,@$Y32}{@$X33,@$Y33}(@$X34,@$Y34){@$X35,@$Y35}{@$X36,@$Y36}(@$X1,@$Y1), テンポ, 待ち);

}

//=============================================================================//

function FadeFF("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X9 = ($X1 / 9) + 5;
	$X8 = ($X1 / 9) * 2 + - 10;
	$X7 = ($X1 / 9) * 3 + - 10;
	$X6 = ($X1 / 9) * 4 + 5;
	$X5 = ($X1 / 9) * 5 + - 10;
	$X4 = ($X1 / 9) * 6 + - 10;
	$X3 = ($X1 / 9) * 7 + - 10;
	$X2 = ($X1 / 9) * 8 + 5;

	$Y1 = - $y;
	$Y9 = ($Y1 / 9) + - 10;
	$Y8 = ($Y1 / 9) * 2 + 10;
	$Y7 = ($Y1 / 9) * 3 + -5;
	$Y6 = ($Y1 / 9) * 4 + -10;
	$Y5 = ($Y1 / 9) * 5 + 5;
	$Y4 = ($Y1 / 9) * 6 + 0;
	$Y3 = ($Y1 / 9) * 7 + 10;
	$Y2 = ($Y1 / 9) * 8 + -10;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@0,@0), テンポ, 待ち);

}

function FadeFF2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X18 = ($X1 / 9) + 5;
	$X17 = ($X1 / 9) * 2 + 10;
	$X16 = ($X1 / 9) * 3 + 15;
	$X15 = ($X1 / 9) * 4 + 10;
	$X14 = ($X1 / 9) * 5 + 5;
	$X13 = ($X1 / 9) * 6 + 0;
	$X12 = ($X1 / 9) * 7 + - 5;
	$X11 = ($X1 / 9) * 8 + 5;

	$Y1 = - $y;
	$Y18 = ($Y1 / 9) + -15;
	$Y17 = ($Y1 / 9) * 2 + -10;
	$Y16 = ($Y1 / 9) * 3 + -5;
	$Y15 = ($Y1 / 9) * 4 + 0;
	$Y14 = ($Y1 / 9) * 5 + 5;
	$Y13 = ($Y1 / 9) * 6 + 10;
	$Y12 = ($Y1 / 9) * 7 + 15;
	$Y11 = ($Y1 / 9) * 8 + 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@0,@0), テンポ, 待ち);

}


function FadeFF3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X18 = ($X1 / 18) + 5;
	$X17 = ($X1 / 18) * 2 + - 10;
	$X16 = ($X1 / 18) * 3 + - 10;
	$X15 = ($X1 / 18) * 4 + 5;
	$X14 = ($X1 / 18) * 5 + - 10;
	$X13 = ($X1 / 18) * 6 + - 10;
	$X12 = ($X1 / 18) * 7 + - 10;
	$X11 = ($X1 / 18) * 8 + 5;
	$X10 = ($X1 / 18) * 9 + 0;
	$X9 = ($X1 / 18) * 10 + 5;
	$X8 = ($X1 / 18) * 11 + 10;
	$X7 = ($X1 / 18) * 12 + 15;
	$X6 = ($X1 / 18) * 13 + 10;
	$X5 = ($X1 / 18) * 14 + 5;
	$X4 = ($X1 / 18) * 15 + 0;
	$X3 = ($X1 / 18) * 16 + - 5;
	$X2 = ($X1 / 18) * 17 + 5;

	$Y1 = - $y;
	$Y18 = ($Y1 / 18) + - 10;
	$Y17 = ($Y1 / 18) * 2 + 10;
	$Y16 = ($Y1 / 18) * 3 + -5;
	$Y15 = ($Y1 / 18) * 4 + -10;
	$Y14 = ($Y1 / 18) * 5 + 5;
	$Y13 = ($Y1 / 18) * 6 + 0;
	$Y12 = ($Y1 / 18) * 7 + 10;
	$Y11 = ($Y1 / 18) * 8 + -10;
	$Y10 = ($Y1 / 18) * 9 + 0;
	$Y9 = ($Y1 / 18) * 10 + -15;
	$Y8 = ($Y1 / 18) * 11 + -10;
	$Y7 = ($Y1 / 18) * 12 + -5;
	$Y6 = ($Y1 / 18) * 13 + 0;
	$Y5 = ($Y1 / 18) * 14 + 5;
	$Y4 = ($Y1 / 18) * 15 + 10;
	$Y3 = ($Y1 / 18) * 16 + 15;
	$Y2 = ($Y1 / 18) * 17 + 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X10,@$Y10){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@0,@0), テンポ, 待ち);

}

function FadeFF4("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X36 = ($X1 / 36) * 1 + 5;
	$X35 = ($X1 / 36) * 2 + - 10;
	$X34 = ($X1 / 36) * 3 + - 10;
	$X33 = ($X1 / 36) * 4 + 5;
	$X32 = ($X1 / 36) * 5 + - 10;
	$X31 = ($X1 / 36) * 6 + - 10;
	$X30 = ($X1 / 36) * 7 + - 10;
	$X29 = ($X1 / 36) * 8 + 5;
	$X28 = ($X1 / 36) * 9 + 0;
	$X27 = ($X1 / 36) * 10 + 5;
	$X26 = ($X1 / 36) * 11 + 10;
	$X25 = ($X1 / 36) * 12 + 15;
	$X24 = ($X1 / 36) * 13 + 10;
	$X23 = ($X1 / 36) * 14 + 5;
	$X22 = ($X1 / 36) * 15 + 0;
	$X21 = ($X1 / 36) * 16 + - 5;
	$X20 = ($X1 / 36) * 17 + 5;
	$X19 = ($X1 / 36) * 18;
	$X18 = ($X1 / 36) * 19 + 5;
	$X17 = ($X1 / 36) * 20 + - 10;
	$X16 = ($X1 / 36) * 21 + - 10;
	$X15 = ($X1 / 36) * 22 + 5;
	$X14 = ($X1 / 36) * 23 + - 10;
	$X13 = ($X1 / 36) * 24 + - 10;
	$X12 = ($X1 / 36) * 25 + - 10;
	$X11 = ($X1 / 36) * 26 + 5;
	$X10 = ($X1 / 36) * 27 + 0;
	$X9 = ($X1 / 36) * 28 + 5;
	$X8 = ($X1 / 36) * 29 + 10;
	$X7 = ($X1 / 36) * 30 + 15;
	$X6 = ($X1 / 36) * 31 + 10;
	$X5 = ($X1 / 36) * 32 + 5;
	$X4 = ($X1 / 36) * 33 + 0;
	$X3 = ($X1 / 36) * 34 + - 5;
	$X2 = ($X1 / 36) * 35 + 5;


	$Y1 = - $y;
	$Y36 = ($Y1 / 36) * 1 + - 10;
	$Y35 = ($Y1 / 36) * 2 + 10;
	$Y34 = ($Y1 / 36) * 3 + -5;
	$Y33 = ($Y1 / 36) * 4 + -10;
	$Y32 = ($Y1 / 36) * 5 + 5;
	$Y31 = ($Y1 / 36) * 6 + 0;
	$Y30 = ($Y1 / 36) * 7 + 10;
	$Y29 = ($Y1 / 36) * 8 + -10;
	$Y28 = ($Y1 / 36) * 9 + 0;
	$Y27 = ($Y1 / 36) * 10 + -15;
	$Y26 = ($Y1 / 36) * 11 + -10;
	$Y25 = ($Y1 / 36) * 12 + -5;
	$Y24 = ($Y1 / 36) * 13 + 0;
	$Y23 = ($Y1 / 36) * 14 + 5;
	$Y22 = ($Y1 / 36) * 15 + 10;
	$Y21 = ($Y1 / 36) * 16 + 15;
	$Y20 = ($Y1 / 36) * 17 + 5;
	$Y19 = ($Y1 / 36) * 18;
	$Y18 = ($Y1 / 36) * 19 + - 10;
	$Y17 = ($Y1 / 36) * 20 + 10;
	$Y16 = ($Y1 / 36) * 21 + -5;
	$Y15 = ($Y1 / 36) * 22 + -10;
	$Y14 = ($Y1 / 36) * 23 + 5;
	$Y13 = ($Y1 / 36) * 24 + 0;
	$Y12 = ($Y1 / 36) * 25 + 10;
	$Y11 = ($Y1 / 36) * 26 + -10;
	$Y10 = ($Y1 / 36) * 27 + 0;
	$Y9 = ($Y1 / 36) * 28 + -15;
	$Y8 = ($Y1 / 36) * 29 + -10;
	$Y7 = ($Y1 / 36) * 30 + -5;
	$Y6 = ($Y1 / 36) * 31 + 0;
	$Y5 = ($Y1 / 36) * 32 + 5;
	$Y4 = ($Y1 / 36) * 33 + 10;
	$Y3 = ($Y1 / 36) * 34 + 15;
	$Y2 = ($Y1 / 36) * 35 + 5;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X3,@$Y3}(@$X4,@$Y4){@$X5,@$Y5}{@$X6,@$Y6}(@$X7,@$Y7){@$X8,@$Y8}{@$X9,@$Y9}(@$X10,@$Y10){@$X11,@$Y11}{@$X12,@$Y12}(@$X13,@$Y13){@$X14,@$Y14}{@$X15,@$Y15}(@$X16,@$Y16){@$X17,@$Y17}{@$X18,@$Y18}(@$X19,@$Y19){@$X20,@$Y20}{@$X21,@$Y21}(@$X22,@$Y22){@$X23,@$Y23}{@$X24,@$Y24}(@$X25,@$Y25){@$X26,@$Y26}{@$X27,@$Y27}(@$X28,@$Y28){@$X29,@$Y29}{@$X30,@$Y30}(@$X31,@$Y31){@$X32,@$Y32}{@$X33,@$Y33}(@$X34,@$Y34){@$X35,@$Y35}{@$X36,@$Y36}(@0,@0), テンポ, 待ち);

}

//―――――――――――――――――――――――――――――――――――――――
....//戻り
//―――――――――――――――――――――――――――――――――――――――

function FadeT("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 2) * 3;

	$Y1 = $y;
	$Y2 = ($Y1 / 2) * 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y1}{@$X2,@$Y2}(@$X1,@$Y1), テンポ, 待ち);
}

function FadeTT("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X2 = $x / 2;

	$Y1 = - $y;
	$Y2 = $y / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@0,@0}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
....//進み
//―――――――――――――――――――――――――――――――――――――――

function FadeV("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = - $X1 / 2;

	$Y1 = $y;
	$Y2 = - $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y2}{@0,@0}(@$X1,@$Y1), テンポ, 待ち);
}

function FadeVV("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X2 = ($X1 / 2) * 3;

	$Y1 = - $y;
	$Y2 = ($Y1 / 2) * 3;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@$Y1){@$X2,@$Y2}{@$X1,@$Y1}(@0,@0), テンポ, 待ち);
}


//―――――――――――――――――――――――――――――――――――――――
....//ジェット
//―――――――――――――――――――――――――――――――――――――――

function FadeJ("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 30) * 28;
	$X3 = ($X1 / 30) * 29;

	$Y1 = $y;
	$Y2 = $Y1 / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y2}(@$X1,@0), テンポ, 待ち);
}


function FadeJ2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 30) * 23;
	$X3 = ($X1 / 30) * 25;
	$X4 = ($X1 / 30) * 27;
	$X5 = ($X1 / 30) * 28;
	$X6 = ($X1 / 30) * 29;

	$Y1 = $y;
	$Y2 = $Y1 / 2;
	$Y3 = ($y / 4) * 2;
	$Y4 = ($y / 4) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y4}(@$X1,@0), テンポ, 待ち);
}


function FadeJ3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 30) * 15;
	$X3 = ($X1 / 30) * 18;
	$X4 = ($X1 / 30) * 21;
	$X5 = ($X1 / 30) * 23;
	$X6 = ($X1 / 30) * 25;
	$X7 = ($X1 / 30) * 27;
	$X8 = ($X1 / 30) * 28;
	$X9 = ($X1 / 30) * 29;

	$Y1 = $y;
	$Y2 = $Y1 / 2;
	$Y3 = ($y / 4) * 2;
	$Y4 = ($y / 4) * 1;
	$Y5 = ($y / 6) * 2;
	$Y6 = ($y / 6) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y5}{@$X9,@$Y6}(@$X1,@0), テンポ, 待ち);
}

//=============================================================================//


//=============================================================================//

function FadeJJ("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X2 = ($X1 / 30) * 2;
	$X3 = ($X1 / 30) * 1;

	$Y1 = $y;
	$Y2 = $y / 2;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y2}(@0,@0), テンポ, 待ち);
}


function FadeJJ2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X2 = ($X1 / 30) * 7;
	$X3 = ($X1 / 30) * 5;
	$X4 = ($X1 / 30) * 3;
	$X5 = ($X1 / 30) * 2;
	$X6 = ($X1 / 30) * 1;

	$Y1 = $y;
	$Y2 = $y / 2;
	$Y3 = ($y / 4) * 2;
	$Y4 = ($y / 4) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y4}(@0,@0), テンポ, 待ち);
}

function FadeJJ3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = - $x;
	$X2 = ($X1 / 30) * 15;
	$X3 = ($X1 / 30) * 12;
	$X4 = ($X1 / 30) * 9;
	$X5 = ($X1 / 30) * 7;
	$X6 = ($X1 / 30) * 5;
	$X7 = ($X1 / 30) * 3;
	$X8 = ($X1 / 30) * 2;
	$X9 = ($X1 / 30) * 1;

	$Y1 = $y;
	$Y2 = $y / 2;
	$Y3 = ($y / 4) * 2;
	$Y4 = ($y / 4) * 1;
	$Y5 = ($y / 6) * 2;
	$Y6 = ($y / 6) * 1;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@$X1,@0){@$X2,@$Y1}{@$X3,@$Y2}(@$X4,@0){@$X5,@$Y3}{@$X6,@$Y4}(@$X7,@0){@$X8,@$Y5}{@$X9,@$Y6}(@0,@0), テンポ, 待ち);
}




//―――――――――――――――――――――――――――――――――――――――
....//高速運動
//―――――――――――――――――――――――――――――――――――――――

function FadeI("ナット名",t,テンポ,待ち)
{
	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@-260,@-250){@-160,@150}{@-60,@50}(@140,@250){@-160,@150}{@-60,@50}(@0,@0), テンポ, 待ち);
}

function FadeI("ナット名",t,テンポ,待ち)
{
	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@260,@-250){@160,@150}{@60,@50}(@-140,@250){@160,@150}{@60,@50}(@0,@0), テンポ, 待ち);
}





//―――――――――――――――――――――――――――――――――――――――
....//∞移動
//―――――――――――――――――――――――――――――――――――――――
//―――――――――――――――――――――――――――――――――――――――
.....//Ⅹ均等
//―――――――――――――――――――――――――――――――――――――――

function FadeXB("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 3) * 1;

	$X4 = -$X1;
	$X5 = -$X2;

	$Y1 = $y;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X1,@$Y1}(@$X1,@0){@$X1,@$Y2}{@$X2,@$Y2}(@0,@0){@$X5,@$Y1}{@$X4,@$Y1}(@$X4,@0){@$X4,@$Y2}{@$X5,@$Y2}(@0,@0), テンポ, 待ち);

}

function FadeXB2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 3) * 1;

	$X4 = -$X1;
	$X5 = -$X2;

	$Y1 = $y;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X1,@$Y1}(@$X1,@0){@$X1,@$Y2}{@$X2,@$Y2}(@0,@0){@$X5,@$Y1}{@$X4,@$Y1}(@$X4,@0){@$X4,@$Y2}{@$X5,@$Y2}(@0,@0){@$X2,@$Y1}{@$X1,@$Y1}(@$X1,@0){@$X1,@$Y2}{@$X2,@$Y2}(@0,@0){@$X5,@$Y1}{@$X4,@$Y1}(@$X4,@0){@$X4,@$Y2}{@$X5,@$Y2}(@0,@0), テンポ, 待ち);

}

function FadeXB3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = ($X1 / 3) * 1;

	$X4 = -$X1;
	$X5 = -$X2;

	$Y1 = $y;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X1,@$Y1}(@$X1,@0){@$X1,@$Y2}{@$X2,@$Y2}(@0,@0){@$X5,@$Y1}{@$X4,@$Y1}(@$X4,@0){@$X4,@$Y2}{@$X5,@$Y2}(@0,@0){@$X2,@$Y1}{@$X1,@$Y1}(@$X1,@0){@$X1,@$Y2}{@$X2,@$Y2}(@0,@0){@$X5,@$Y1}{@$X4,@$Y1}(@$X4,@0){@$X4,@$Y2}{@$X5,@$Y2}(@0,@0){@$X2,@$Y1}{@$X1,@$Y1}(@$X1,@0){@$X1,@$Y2}{@$X2,@$Y2}(@0,@0){@$X5,@$Y1}{@$X4,@$Y1}(@$X4,@0){@$X4,@$Y2}{@$X5,@$Y2}(@0,@0), テンポ, 待ち);

}

//―――――――――――――――――――――――――――――――――――――――
.....//Ｙ均等
//―――――――――――――――――――――――――――――――――――――――

function FadeYB("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = ($Y1 / 3) * 1;

	$Y4 = -$Y1;
	$Y5 = -$Y2;

	$X1 = $x;
	$X2 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y1}(@0,@$Y1){@$X2,@$Y1}{@$X2,@$Y2}(@0,@0){@$X1,@$Y5}{@$X1,@$Y4}(@0,@$Y4){@$X2,@$Y4}{@$X2,@$Y5}(@0,@0), テンポ, 待ち);

}

function FadeYB2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = ($Y1 / 3) * 1;

	$Y4 = -$Y1;
	$Y5 = -$Y2;

	$X1 = $x;
	$X2 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y1}(@0,@$Y1){@$X2,@$Y1}{@$X2,@$Y2}(@0,@0){@$X1,@$Y5}{@$X1,@$Y4}(@0,@$Y4){@$X2,@$Y4}{@$X2,@$Y5}(@0,@0){@$X1,@$Y2}{@$X1,@$Y1}(@0,@$Y1){@$X2,@$Y1}{@$X2,@$Y2}(@0,@0){@$X1,@$Y5}{@$X1,@$Y4}(@0,@$Y4){@$X2,@$Y4}{@$X2,@$Y5}(@0,@0), テンポ, 待ち);

}

function FadeYB3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = ($Y1 / 3) * 1;

	$Y4 = -$Y1;
	$Y5 = -$Y2;

	$X1 = $x;
	$X2 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y1}(@0,@$Y1){@$X2,@$Y1}{@$X2,@$Y2}(@0,@0){@$X1,@$Y5}{@$X1,@$Y4}(@0,@$Y4){@$X2,@$Y4}{@$X2,@$Y5}(@0,@0){@$X1,@$Y2}{@$X1,@$Y1}(@0,@$Y1){@$X2,@$Y1}{@$X2,@$Y2}(@0,@0){@$X1,@$Y5}{@$X1,@$Y4}(@0,@$Y4){@$X2,@$Y4}{@$X2,@$Y5}(@0,@0){@$X1,@$Y2}{@$X1,@$Y1}(@0,@$Y1){@$X2,@$Y1}{@$X2,@$Y2}(@0,@0){@$X1,@$Y5}{@$X1,@$Y4}(@0,@$Y4){@$X2,@$Y4}{@$X2,@$Y5}(@0,@0), テンポ, 待ち);

}













//―――――――――――――――――――――――――――――――――――――――
....//∞移動２
//―――――――――――――――――――――――――――――――――――――――
//―――――――――――――――――――――――――――――――――――――――
.....//Ⅹ均等
//―――――――――――――――――――――――――――――――――――――――

function FadeXE("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = 0;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 6;

	$Y1 = $y;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0){@$X6,@$Y1}{@$X5,@$Y1}(@$X4,@0){@$X3,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadeXE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = 0;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 6;

	$Y1 = $y;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0){@$X6,@$Y1}{@$X5,@$Y1}(@$X4,@0){@$X3,@$Y2}{@$X2,@$Y2}(@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0){@$X6,@$Y1}{@$X5,@$Y1}(@$X4,@0){@$X3,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

function FadeXE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$X1 = $x;
	$X2 = 0;
	$X3 = ($X1 / 6) * 2;
	$X4 = ($X1 / 6) * 3;
	$X5 = ($X1 / 6) * 4;
	$X6 = ($X1 / 6) * 6;

	$Y1 = $y;
	$Y2 = - $y;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0){@$X6,@$Y1}{@$X5,@$Y1}(@$X4,@0){@$X3,@$Y2}{@$X2,@$Y2}(@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0){@$X6,@$Y1}{@$X5,@$Y1}(@$X4,@0){@$X3,@$Y2}{@$X2,@$Y2}(@0,@0){@$X2,@$Y1}{@$X3,@$Y1}(@$X4,@0){@$X5,@$Y2}{@$X6,@$Y2}(@$X1,@0){@$X6,@$Y1}{@$X5,@$Y1}(@$X4,@0){@$X3,@$Y2}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}

//―――――――――――――――――――――――――――――――――――――――
.....//Ｙ均等
//―――――――――――――――――――――――――――――――――――――――

function FadeYE("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = 0;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 6;

	$X1 = $x;
	$X2 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1){@$X1,@$Y6}{@$X1,@$Y5}(@0,@$Y4){@$X2,@$Y3}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}


function FadeYE2("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = 0;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 6;

	$X1 = $x;
	$X2 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1){@$X1,@$Y6}{@$X1,@$Y5}(@0,@$Y4){@$X2,@$Y3}{@$X2,@$Y2}(@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1){@$X1,@$Y6}{@$X1,@$Y5}(@0,@$Y4){@$X2,@$Y3}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}


function FadeYE3("ナット名",描画時間,透過度,t,$x,$y,テンポ, 待ち)
{
	$Y1 = $y;
	$Y2 = 0;
	$Y3 = ($Y1 / 6) * 2;
	$Y4 = ($Y1 / 6) * 3;
	$Y5 = ($Y1 / 6) * 4;
	$Y6 = ($Y1 / 6) * 6;

	$X1 = $x;
	$X2 = - $x;

	Fade("ナット名",描画時間,透過度,null,false);
	BezierMove("ナット名", t, (@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1){@$X1,@$Y6}{@$X1,@$Y5}(@0,@$Y4){@$X2,@$Y3}{@$X2,@$Y2}(@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1){@$X1,@$Y6}{@$X1,@$Y5}(@0,@$Y4){@$X2,@$Y3}{@$X2,@$Y2}(@0,@0){@$X1,@$Y2}{@$X1,@$Y3}(@0,@$Y4){@$X2,@$Y5}{@$X2,@$Y6}(@0,@$Y1){@$X1,@$Y6}{@$X1,@$Y5}(@0,@$Y4){@$X2,@$Y3}{@$X2,@$Y2}(@0,@0), テンポ, 待ち);
}














